[
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/jlcd1?source=/course-catalog-gateway",
    "code": "JLCD1",
    "name": "Logos, Cosmos, and Doubt",
    "description": "This year-long course provides an interdisciplinary introduction to philosophical thinking and the modes of inquiry examined in the rest of the Core curriculum. Beginning with an investigation of themes from spacetime and theories about what exists, students explore ecological relations, historical approaches to doubt, introductory logical explanations, and fundamental questions about what we know (if anything!) and how we know what we know, before examining different views on how to live well as an individual and a member of a global community.",
    "subject": "Core",
    "level": "Middle School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "jlcd1"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/jhns2?source=/course-catalog-gateway",
    "code": "JHNS2",
    "name": "Human Nature and Society",
    "description": "This year-long course examines what it means to be human and to live in society with others. Drawing on short philosophical, scientific, and literary writings, students explore questions about what the innate features of human beings are, what kinds of motives and behaviors are characteristic of humans, what kinds of methods thinkers use in theorizing about human nature, and how societal and educational institutions should be shaped by our theories of human nature. The course prepares students for the high-school Core sequence, as well as for further work in the humanities, by strengthening and broadening their skills in critical reading, reasoning, and writing.",
    "subject": "Core",
    "level": "Middle School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "jhns2"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/omsb9?source=/course-catalog-gateway",
    "code": "OMSB9",
    "name": "Methodology of Science - Biology",
    "description": "This year-long course uses biology as the primary context for an introduction to scientific reasoning, statistical analysis, and philosophical thinking. In the fall semester, students will explore how organisms interact with each other and their environments; in the spring, the main topic will be the environmental and genetic influences on an organism's behavior (including inheritance and natural selection). Along the way, students will be exposed to illustrative examples of experimental design, to various statistical concepts/techniques used to interpret and make inferences from data, and to foundational questions about the underlying nature of the concepts and methods at issue. The aim is to help students learn about the richly analytical processes of science – making conjectures and discoveries, obtaining evidence for scientific claims, assessing the evidence presented by others – and finally to become comfortable with setting up their own experiments and interpreting experimental data.",
    "subject": "Core",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "omsb9"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ohsc0?source=/course-catalog-gateway",
    "code": "OHSC0",
    "name": "History and Philosophy of Science",
    "description": "This year-long course examines the context in which science flourishes and the nature, benefits, and limitations of doing science by exploring its significant ideas, observations, and experiments. Using a historical survey approach, students examine the interplay between observations of the physical world, attempts to explain those observations, and the methods used to test the resulting explanations. As part of the methodology of the inquiry, students learn and practice the skills of philosophical analysis, logical argument, and criticism. Topics may include Aristotle's physics and biology; ancient astronomies in Hellenistic and Islamic cultures; ancient medical study in Greece, China, and India; the transition to a heliocentric Copernican astronomical model and the advent of modern scientific revolutions; the rise of chemistry; and modern advances including the development of atomism, electromagnetism, evolutionary theory, relativity and quantum theory, and key issues in contemporary philosophy of science.",
    "subject": "Core",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ohsc0"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/odfrl?source=/course-catalog-gateway",
    "code": "ODFRL",
    "name": "Democracy, Freedom, Justice, and the Law",
    "description": "This year-long course examines the foundations of civil society. Drawing on both historical and theoretical materials, the students study changing conceptions of how a state is and should be organized. In particular, we focus on different treatments of the interwoven concepts of democracy, freedom, justice, and the law. As part of their study, students practice the methodological tools of analysis relevant to philosophy and political theory, learn to formulate and evaluate proposals about the content of critical concepts, and develop a thorough knowledge of their political traditions and principles. These lessons contribute to the broader aim of the course, which is to prepare students for citizenship in their community by refining their ability to participate constructively in the discourse that draws on these conceptions of the state. While the course is organized around principles of American government, the readings are germane to democratic society generally. Readings may include Hobbes, Locke, Rousseau, American founding texts, Addams, Berlin, Rawls, Nozick, Sandel, Sen, Marx, and many others.",
    "subject": "Core",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "odfrl"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ocra1?source=/course-catalog-gateway",
    "code": "OCRA1",
    "name": "Critical Reading and Argumentation",
    "description": "In addition to the unique problems and questions that constitute its subject matter, philosophy makes use of a variety of intellectual tools and argumentative strategies that are widely applicable to both academic and informal inquiry. This course helps students develop these resources through a careful analysis of exemplary pieces of philosophical argument and literature. To this end, we explore philosophical thinking about modes of reasoning as well as such core philosophical topics as the existence of God, the nature and limits of knowledge, the nature and content of ethics, and the mind's relation to the world. While the course emphasizes the cultivation of the tools and strategies of reading and argument, the materials encourage reflection on some of the foundational characteristics and assumptions in the disciplines of ethics, religion, and philosophy itself. Readings may include Plato, Aristotle, Aquinas, Leibniz, Voltaire, Locke, Mill, Hume, Kant, Camus, Descartes, Kafka, Nietzsche, as well as more contemporary authors such as Le Guin, Hursthouse, Vargas, Gyekye, Beebee, and Ismael.",
    "subject": "Core",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ocra1"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ophi25?source=/course-catalog-gateway",
    "code": "OPHI25",
    "name": "Advanced Topics in Philosophy I",
    "description": "Topic for Fall 2025: Free Will and Moral Responsibility. In this course we’ll engage with a set of perennial philosophical issues: the related questions of what “free will” is, whether any of us have it, and how the answers to these questions bear on our practical lives (especially our moral and legal responsibility and ethical practices). Much of the work in this domain has revolved around the question of whether or not freedom is compatible with causal determinism, that is, whether we can be free if everything that we do is the result of previous causes. We will try and get a sense of the main types of answers to this question, as well as their bearing on responsibility and other ethical concepts. Though this will be the central focus in the course, along the way we may consider related questions such as: Might we be capable of freedom in some sense but not morally responsible? Do all of our moral, legal, and other interpersonal norms, attitudes, and practices stand and fall together, depending on whether we are free and the kind of freedom we have? Can there be degrees of freedom? Are there different kinds of causation relevant to freedom? What is the best way to discover whether we are free or not: philosophy, science, or both? This course is also offered as a full-credit writing option (OPHI27).",
    "subject": "Core",
    "level": "High School",
    "semester": "Fall",
    "prerequisites": [],
    "slug": "ophi25"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ophi27?source=/course-catalog-gateway",
    "code": "OPHI27",
    "name": "Advanced Topics in Philosophy I: Writing Option",
    "description": "Topic for Fall 2025: Free Will and Moral Responsibility. In this course we’ll engage with a set of perennial philosophical issues: the related questions of what “free will” is, whether any of us have it, and how the answers to these questions bear on our practical lives (especially our moral and legal responsibility and ethical practices). Much of the work in this domain has revolved around the question of whether or not freedom is compatible with causal determinism, that is, whether we can be free if everything that we do is the result of previous causes. We will try and get a sense of the main types of answers to this question, as well as their bearing on responsibility and other ethical concepts. Though this will be the central focus in the course, along the way we may consider related questions such as: Might we be capable of freedom in some sense but not morally responsible? Do all of our moral, legal, and other interpersonal norms, attitudes, and practices stand and fall together, depending on whether we are free and the kind of freedom we have? Can there be degrees of freedom? Are there different kinds of causation relevant to freedom? What is the best way to discover whether we are free or not: philosophy, science, or both? The writing option of this course enables students to delve more deeply into the concepts and questions involved with the topic through additional research and writing assignments.",
    "subject": "Core",
    "level": "High School",
    "semester": "Fall",
    "prerequisites": [],
    "slug": "ophi27"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ophi28?source=/course-catalog-gateway",
    "code": "OPHI28",
    "name": "Advanced Topics in Philosophy II: Writing Option",
    "description": "Topic for Spring 2026: Philosophy of Education. As a student, you almost certainly have thought deeply about the philosophy of education before: Is education primarily about learning facts? To what degree should education be standardized or individualized? Should teachers be neutral about contested moral issues? What is the difference between education for liberation and indoctrination? What is the appropriate authority relation between a teacher and a student? Do grades help or hinder education? Do you get an education primarily to get a job or rather to be a good person and citizen? Are STEM subjects and humanities equally important? What degree of education is required of citizens in a healthy democracy? In this course, we will address these and other philosophical questions by delving into the thought of classic figures in the philosophy of education, including Plato, Rousseau, Dewey, and Freire. We will also engage with contemporary insights from education theorists and psychologists. By the end of the course, you will develop a deeper and richer sense of education’s role in your life and your broader community. The writing option of this course enables students to delve more deeply into the concepts and questions involved with the topic through additional research and writing assignments.",
    "subject": "Core",
    "level": "High School",
    "semester": "Spring",
    "prerequisites": [],
    "slug": "ophi28"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/je01x?source=/course-catalog-gateway",
    "code": "JE01X",
    "name": "Worlds of Literature",
    "description": "In this class we use the idea of \"world-building\" as a way of understanding how to approach works from different time periods and perspectives. In the first semester students read works of science fiction, fantasy, historical fiction, and survival fiction, and practice focusing on details that tell us about the nature of the fictional world. In the second semester, students apply the same skills to reading Great Expectations and Macbeth. Writing assignments focus on identifying ideas that the student finds important and supporting them with textual evidence, building and supporting strong thesis statements.",
    "subject": "English",
    "level": "Middle School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "je01x"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/je001?source=/course-catalog-gateway",
    "code": "JE001",
    "name": "Fundamentals of Expository Writing",
    "description": "Fundamentals of Expository Writing is a year-long course that introduces students to the nuts and bolts of critical reading and writing. Through detailed analysis of texts, students decode complex works of literature, and build on their understanding of the mechanics of the sentence to consider more abstract topics such as audience, expectation, and authorial persona. They also master the basic essay form.",
    "subject": "English",
    "level": "Middle School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "je001"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/je002?source=/course-catalog-gateway",
    "code": "JE002",
    "name": "Taking Literature Apart",
    "description": "Taking Literature Apart is a year-long course designed to develop and strengthen students' skills in writing, literary interpretation, and critical thinking. A second key goal of this course is to expose students to a variety of major works of literature in different genres. Students will become familiar with the elements of narrative fiction and poetry and gain the tools to analyze literary works productively with attention to form, content, and style. Other concepts covered include figurative language, tone, close reading, prewriting tactics, thesis development, diction and clarity, paragraph unity, argumentative structure, and revision.",
    "subject": "English",
    "level": "Middle School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "je002"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/je01wl?source=/course-catalog-gateway",
    "code": "JE01WL",
    "name": "Fundamentals of Expository Writing Lab",
    "description": "The OHS Writing and Tutoring Center offers supplemental weekly Writing Labs. These weekly labs are intended to support students in completing their writing assignments in Fundamentals of Expository Writing (JE001). Experienced writing tutors work with students on every aspect of the writing process—from close reading and prewriting strategies to the final revision and edit—as they strive toward completion of major and minor assignments. Students enrolled in these labs commit to attending all meetings. Enrollment is limited with some space reserved for students upon recommendation of their instructor. This writing lab will commence during Week 6 of the academic year.",
    "subject": "English",
    "level": "Middle School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "je01wl"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/je02wl?source=/course-catalog-gateway",
    "code": "JE02WL",
    "name": "Taking Literature Apart Writing Lab",
    "description": "The OHS Writing and Tutoring Center offers supplemental weekly Writing Labs. These weekly labs are intended to support students in completing their writing assignments in Taking Literature Apart (JE002). Experienced writing tutors work with students on every aspect of the writing process—from close reading and prewriting strategies to the final revision and edit—as they strive toward completion of major and minor assignments. Students enrolled in these labs commit to attending all meetings. Enrollment is limited with some space reserved for students upon recommendation of their instructor. This writing lab will commence during the first full week of classes of the academic year.",
    "subject": "English",
    "level": "Middle School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "je02wl"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/jecw1a?source=/course-catalog-gateway",
    "code": "JECW1A",
    "name": "Creative Writing",
    "description": "This course provides a chance for students to explore the craft of writing – poetry, fiction, and creative nonfiction – to discover what they want to say about themselves and their individual perspectives in and through written language. Students will discuss a variety of creative composition strategies, including figurative language, sound, imagery, voice, and style. They will read poems, personal essays, short stories, and essays on the craft of writing as inspiration for their own work in these genres. Students may enroll in either semester and are encouraged to enroll for both fall and spring.",
    "subject": "English",
    "level": "Middle School",
    "semester": "Fall or Spring",
    "prerequisites": [],
    "slug": "jecw1a"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oe009?source=/course-catalog-gateway",
    "code": "OE009",
    "name": "Literary Analysis and Argumentation",
    "description": "Literary Analysis and Argumentation deepens students' skills in close textual analysis of literature, in making and supporting meaningful arguments, and in crafting elegant argumentative prose. Students will hone their critical writing skills, particularly with regard to thesis development, paragraph unity, and argumentative structure. The reading is from a wide range of literary genres; most are from the British tradition, organized chronologically. Students will thus explore how the tradition evolved and how it reflected or drove developments elsewhere in British culture, gaining a deeper appreciation for the complex, two-way relationship between literature and history.",
    "subject": "English",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oe009"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oe010?source=/course-catalog-gateway",
    "code": "OE010",
    "name": "Textual Analysis and Argumentation",
    "description": "Textual Analysis and Argumentation is a survey of American literature in a global context. Working with diverse texts, students master close reading for form and rhetoric. Students will consider thematically related clusters of texts (such as the captivity narrative) and pay close attention to how writing constructs authorial and even cultural identity. Students move far beyond summary and comprehension to write essays with precise, developed arguments about the texts that we read. They learn to develop their essay topics with increasing independence and are introduced to, and become competent in, MLA style.",
    "subject": "English",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oe010"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oe011?source=/course-catalog-gateway",
    "code": "OE011",
    "name": "Modes of Writing and Argumentation",
    "description": "Modes of Writing and Argumentation builds upon the argumentative structures and generic terminology covered in TAA to introduce students to literary terms and more formalized theoretical approaches to literature, including narrative, genre, intertextuality, and metaphor. Students continue the work of reading texts in conversation and competition with their predecessors and, in longer essays that require more sophisticated argumentative structures to support complex claims, they begin to articulate their own theory of intertextuality in action. Students solidify their mastery of MLA style, and continue to develop oral presentation skills to complement their skill in writing.",
    "subject": "English",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oe011"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oe10wl?source=/course-catalog-gateway",
    "code": "OE10WL",
    "name": "Textual Analysis and Argumentation Writing Lab",
    "description": "The OHS Writing and Tutoring Center offers supplemental weekly Writing Labs. These weekly labs are intended to support students in completing their writing assignments in Textual Analysis and Argumentation (OE010). Experienced writing tutors work with students on every aspect of the writing process—from close reading and prewriting strategies to the final revision and edit—as they strive toward completion of major and minor assignments. Students enrolled in these labs commit to attending all meetings. Enrollment is limited with some space reserved for students upon recommendation of their instructor. This writing lab will commence during the first full week of classes of the academic year.",
    "subject": "English",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oe10wl"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oe11wl?source=/course-catalog-gateway",
    "code": "OE11WL",
    "name": "Modes of Writing and Argumentation Writing Lab",
    "description": "The OHS Writing and Tutoring Center offers supplemental weekly Writing Labs. These weekly labs are intended to support students in completing their writing assignments in Modes of Writing & Argumentation (OE011). Experienced writing tutors work with students on every aspect of the writing process—from close reading and prewriting strategies to the final revision and edit—as they strive toward completion of major and minor assignments. Students enrolled in these labs commit to attending all meetings. Enrollment is limited with some space reserved for students upon recommendation of their instructor. This writing lab will commence during the first full week of classes of the academic year.",
    "subject": "English",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oe11wl"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oecw1d?source=/course-catalog-gateway",
    "code": "OECW1D",
    "name": "Poetry",
    "description": "Students in this class will explore these central questions about poetry: What is a poem? How is it made? What makes a poem convincing? How do we talk about the poems we make? Through critical analysis of texts, writing exercises, and workshops, students will learn how to read as writers and write as readers. We will explore aspects of craft—stanza, line, rhythm, image, diction, voice—and each student will have the opportunity to receive thoughtful, critical feedback from their instructor and peers. Further, we will create a supportive and engaged community of writers of which everyone is a welcome, integral member. Students will end the course with a portfolio of their poetry. Students are encouraged to take the course more than once to work on their writing in this classroom and community environment. Each semester of Poetry Workshop will involve new readings and writing assignments to foster exploration for students taking the course repeatedly.",
    "subject": "English",
    "level": "High School",
    "semester": "Spring",
    "prerequisites": [],
    "slug": "oecw1d"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oecw1e?source=/course-catalog-gateway",
    "code": "OECW1E",
    "name": "Screen Writing",
    "description": "Screenwriting is a workshop class that introduces students to the fundamentals of screenwriting craft—including script format, dialogue, characterization, visual storytelling, plot, conflict, and structure. One of the main goals of this course will be to instill a sense of scene—what it’s made of, what it should do, etc. We will watch full-length films as well as excerpts from films, and we will read full screenplays as well as excerpts. We will also read some craft essays and worksheets. Over the course of the semester, students will develop an idea for, plan out, and then write a twenty-five-page script. We will workshop these ideas, structures, and final scripts in class. Students will complete a revision of their twenty-five-page screenplays as the final assignment for the class.",
    "subject": "English",
    "level": "High School",
    "semester": "Fall",
    "prerequisites": [],
    "slug": "oecw1e"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oe020b?source=/course-catalog-gateway",
    "code": "OE020B",
    "name": "Critical Theory and the Historical Imagination",
    "description": "What is the past? What does it do? What's it for? In this course we'll look together at how people we don't usually think of as historians–poets, playwrights, filmmakers, musicians, critical theorists, and others–have tried to understand the past, and tried to use the past to understand the present. We'll wander through various genres, historical periods, and ways of thinking, from Shakespearean drama and Dutch Golden Age painting to postmodernist fiction, personal essays, the graphic novel, and Chaos Theory. Authors (of various sorts) include James Baldwin, Marjane Satrapi, Akira Kurosawa, the Kinks, Virginia Woolf, Joan Didion, Yi-Fu Tuan, Tom Stoppard, Seijun Suzuki, and of course you.",
    "subject": "English",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oe020b"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oe020c?source=/course-catalog-gateway",
    "code": "OE020C",
    "name": "Critical Theory of the Anthropocene",
    "description": "\"Critical Theory of the Anthropocene\" aligns with the course goals and major assignments of Critical Theory courses at OHS but with a particular focus on the environmental humanities. We'll investigate the complex relationships between humans and the natural world as well as the language that various groups use to describe such relationships. For example, how are notions of wilderness and civilization, international waters, or even \"nature\" itself grounded in deeper rhetorical and cultural histories? How do literary texts, scientific narratives, and popular media represent environmental crisis and/or imagine alternate, sustainable futures? Drawing on novels, poetry, and documentary film, we'll move across literature, law, and Indigenous studies in order evaluate how rhetorical and critical frameworks shape our understanding of social and ecological systems on a global scale. By the end of the course, students will write college-level essays that demonstrate creative and critical thinking in various modes of persuasive argument. Featured writers include William Apess, Henry David Thoreau, Zitkala-Sa, John Muir, and Terry Tempest Williams. Additional materials include Leslie Marmon Silko's novel Ceremony and N. Scott Momaday's illustrated text The Way to Rainy Mountain, plus critical theory by Lisa Brooks, Michel Foucault, Wai-Chee Dimock, and Elizabeth DeLoughrey",
    "subject": "English",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oe020c"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oe020e?source=/course-catalog-gateway",
    "code": "OE020E",
    "name": "Critical Theory: Canon & Counter-Canon",
    "description": "Of all the literature that an era produces, only a tiny sliver makes it into the \"canon\" – the informal, ever-evolving group of texts that we consider to be the best or most important. These are the texts students read in school, scholars write about, and Hollywood, sometimes, turns into period pieces. But who decides what goes in the canon – and are those texts really the best and most important? To what extent do contemporary biases, values, and fads determine which texts we remember, and which we forget? These questions will guide us as we embark on a tour of the British canon from the Renaissance to the end of the nineteenth century. Like other Critical Theory courses, this class encourages students to challenge big, easy explanations for things, and to ask how we know what we (think we) know. Our investigation will unfold as a series of paired readings. Each unit, focused on a particular historical period, will feature a canonical text that is widely studied, and a non-canonical text that students rarely encounter, but that has the potential to challenge the \"standard\" narrative of that period. Ultimately, students will leave class not only with a better understanding of the British canon as it is currently comprised, but with the critical and methodological tools to question the values and priorities that underlie it.",
    "subject": "English",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oe020e"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oe020z?source=/course-catalog-gateway",
    "code": "OE020Z",
    "name": "Critical Theory: Language and Culture",
    "description": "Language and Culture (CTLC) is a year-long course that introduces students to post-structuralism as a critical methodology for studying literature. Building upon the groundwork laid in TAA and MWA, CTLC asks students to consider why challenges to both epistemological certainty and structuralist and other foundationalist approaches to analyzing literature arose in the context of post-WWII society. Through an intensive study of genres of nonfiction, including creative nonfiction and visual rhetoric, students explore why there were so many challenges to certainty in this time period, what some of the deep roots of the poststructuralist approach are in the premodern period, and what kinds of questions this approach helps us ask and answer not only about literature but also about the world around us. In answering these questions, students also focus on how literary form connects to content and on their own formulation of an ethical writing voice. By the end of the course, students' essays are executed at the college level.",
    "subject": "English",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oe020z"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oe021a?source=/course-catalog-gateway",
    "code": "OE021A",
    "name": "Advanced Literature & Criticism: Wonders and Sublimity",
    "description": "In this year-long, advanced-level class, students will explore different critical approaches to canonical literature, considering a breadth of literary theory. This course will engage students in reading peer-reviewed scholarship about literary texts. Over the course of the year, students will be challenged to situate their original close-readings of literature in relation to at least one scholar or critic, showing how their theses build on, develop, or constructively critique past scholarship. The goal of the course is to guide students through the basics of research in the field of literary studies and to prepare them for college-level English. The fall semester focuses on the theme of \"wonders in paradise,\" looking at the dual meaning of \"wondrous\" as both monstrous and miraculous. Although the course focuses on seventeenth-century British literature, it incorporates an emphasis on intertextuality; thus, we also consider postcolonial Caribbean writers who approach this theme. The spring semester focuses on the theme \"states of ecstasy\" wherein we look at heightened landscapes that confuse boundaries between objective and subjective experiences. The semester moves selectively through literary history from Romanticism to contemporary literature and takes both American and British texts as its key texts.",
    "subject": "English",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oe021a"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oe021b?source=/course-catalog-gateway",
    "code": "OE021B",
    "name": "Advanced Literature & Criticism: Russian Literature",
    "description": "In this year-long, advanced-level class, students will explore different critical approaches to canonical literature, considering a breadth of literary theory. This course will engage students in reading peer-reviewed scholarship about literary texts. Over the course of the year, students will be challenged to situate their original close-readings of literature in relation to at least one scholar or critic, showing how their theses build on, develop, or constructively critique past scholarship. The goal of the course is to guide students through the basics of research in the field of literary studies and to prepare them for college-level English. This course focuses on the interrelationship of history, literature, and philosophy in Russian literature. During the fall semester, students will read novels, stories, and works of criticism from the 19th century, exploring the ways in which these works enter into argument with each other about the potential for personal freedom, the meaning of suffering, and the power (or the limits) of the word. The spring semester will focus on the 20th and 21st centuries, and the ways in which revolution, oppression, and loss were imagined both in literature and film.",
    "subject": "English",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oe021b"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ue031?source=/course-catalog-gateway",
    "code": "UE031",
    "name": "Modernist Literature and Photography",
    "description": "Students in this course study how photography, from its inception in the mid-19th century, rose into a dominant visual genre, and how modernist literature responded, with formal and critical inventions, to the prominence of the new technology. We ask how does such literature adapt to viewing the world through the 'eye' of the camera? What does a 'photographic' literature do? What does such writing look like? How does including photographs in a novel alter that novel? And how does such literature portray contemporary culture? The course begins by analyzing the new visual medium, in contrast to, and as an effect on, new literary writing, such as the first detective fiction invented by Edgar Allan Poe, and Charles Baudelaire's Paris poems or flânerie writing. These 19th century interplays of photography and literature lead to our exploration of how photography affects cultural and literary experimentations in modernist prose narratives (in writers such as Henry James and Virginia Woolf). Throughout the course, critical studies of photography and photographs, e.g. Susan Sontag's On Photography, build student abilities to cross study photography and literature. The work of \"Modernist Literature and Photography\" begins and ends, we might say, with the words Ludwig Wittgenstein: \"Don't take it as a matter of course, but as a remarkable fact, that pictures and fictitious narratives give us pleasure, occupy our minds.\"",
    "subject": "English",
    "level": "University",
    "semester": "Fall",
    "prerequisites": [],
    "slug": "ue031"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ue033?source=/course-catalog-gateway",
    "code": "UE033",
    "name": "Literature & New Technologies",
    "description": "The typewriter, a machine for writing, produces letters on a page in a manner distinct from that of a pencil on a page or keyboard on a screen. Writers in the twentieth century, in fact, took advantage of the typewriter's capabilities and limitations to shape new \"modern\" responses to their worlds, one writer calling his work \"typewriter calligraphy.\" We will begin with adventures in typewriting—close reading poems, studying methods and theories—and further our adventures by adding the tape recorder and digital media to the mix. What do you get if you put a typewriter and a tape recorder together? What does digital poetry tell us about the static character of the typewritten page? Also, we will delve into experiments like these that can engage us with the technology as writers: write a Manifesto of New Technology and Writing; design (e.g., on a typewriter) a page of type for sounds (including your voice) recorded in a public environment.",
    "subject": "English",
    "level": "University",
    "semester": "Spring",
    "prerequisites": [],
    "slug": "ue033"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/jdrw1?source=/course-catalog-gateway",
    "code": "JDRW1",
    "name": "Imagining Your Art",
    "description": "In this course, we will explore fundamentals in drawing to help guide our application and enhance our technical skills and imagination. We will explore visual tools such as linear perspective, structural drawing, composition, measurement, and light logic. We will cover both black and white and color media. With the aid of a still life, we will investigate the tools and techniques used in observational rendering. Through demonstration, class exercises, and critiques, we explore concepts including contour line, cross contour, modeling, uses of marks to show form and space, perspective, scale and measurement, and positive/negative space. The second phase of drawings will challenge us to use various types of mark making in constructing forms. A step-by-step process will be introduced and used in this course supported by lectures and demonstrations. We will also emphasize current trends in art such as concept art, illustrations, and comics, which will help enable us learn to draw humans and animals, understanding the importance of imagination, creativity, expression, and presentation. In-class critiques will help us develop a more informed vocabulary on visual art.",
    "subject": "Humanities",
    "level": "Middle School",
    "semester": "Spring",
    "prerequisites": [],
    "slug": "jdrw1"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ol010?source=/course-catalog-gateway",
    "code": "OL010",
    "name": "Leadership Course Series",
    "description": "The Leadership Course Series seeks to encourage and nurture future leaders. In this seminar-style course, students attend monthly special presentations by Silicon Valley CEOs, entrepreneurs, inventors, professors, investment bankers, Nobel Laureates, politicians, philanthropists and others who share their personal background and their views on leading in the new global economy. Students also review selected readings, maintain a journal, and once a month engage in lively class discussion to explore the complexities and multiple dimensions of leadership through eight central themes or \"lenses\" which are applied to each of the special presentations. Students gain important insights on topics including the qualities of effective leaders, the language of leadership, teamwork, the importance of self-leadership, motivating and inspiring others, the application of design principles to create innovative solutions, and the strategic acquisition and subsequent application of influence and power. This course receives 1 unit of elective credit per semester. Topics vary, and the course may be repeated. In 2025-26, this course will meet Fridays at 3 pm Pacific Time on the following days: Fall 9/5, 9/19, 10/3, 10/17, 11/7, 11/21, 12/5, and 12/12; Spring 1/9, 1/23, 2/6, 2/20, 3/6, 3/20, 4/3, and 4/17.",
    "subject": "Humanities",
    "level": "High School",
    "semester": "Fall or Spring",
    "prerequisites": [],
    "slug": "ol010"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ols10?source=/course-catalog-gateway",
    "code": "OLS10",
    "name": "Legal Studies: Constitutional Law: Writing Option",
    "description": "This course examines present-day U.S. constitutional law. Students will learn some constitutional law as well as how to think critically about it based on comparisons with other nations' laws. Thus, having considered hate speech under the First Amendment, we might study hate-speech laws in Canada; having studied Fifth Amendment rights to remain silent in the U.S.A., we might then consider them in England; having considered what discoveries are patentable under Article I, we might consider how India approaches the problem. To promote meaningful comparison, we will focus on common-law jurisdictions. Topics include constitutional balancings of intra-government powers, as well as constitutional delineations of individual rights. Based on student interest, we may explore how constitutional law protects creations of the mind, such as writings and discoveries; freedom of religion; equal protection; the right to be free from cruel and unusual treatment, or other doctrines. Consistent with U.S. law-school pedagogy, we will study laws as they apply to \"fact patterns,\" which are specific \"material\" facts that cry out for legal interpretation. As we progress through the year, we will shift from general legal principles to questions of how the law applies to real-time, real-world facts and controversies. The spring semester will require students to make their own determinations in a current legal controversy, such as by arguing a position in a case selected from the U.S. Supreme Court's current docket. Legal opinions and legislation are the primary texts; a required textbook on constitutional law is supplemental. Students who take the writing option must complete substantial written assignments in addition to weekly homework and oral presentations.",
    "subject": "Humanities",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ols10"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ols11?source=/course-catalog-gateway",
    "code": "OLS11",
    "name": "Legal Studies: Constitutional Law",
    "description": "This course examines present-day U.S. constitutional law. Students will learn some constitutional law as well as how to think critically about it based on comparisons with other nations' laws. Thus, having considered hate speech under the First Amendment, we might study hate-speech laws in Canada; having studied Fifth Amendment rights to remain silent in the U.S.A., we might then consider them in England; having considered what discoveries are patentable under Article I, we might consider how India approaches the problem. To promote meaningful comparison, we will focus on common-law jurisdictions. Topics include constitutional balancings of intra-government powers, as well as constitutional delineations of individual rights. Based on student interest, we may explore how constitutional law protects creations of the mind, such as writings and discoveries; freedom of religion; equal protection; the right to be free from cruel and unusual treatment, or other doctrines. Consistent with U.S. law-school pedagogy, we will study laws as they apply to \"fact patterns,\" which are specific \"material\" facts that cry out for legal interpretation. As we progress through the year, we will shift from general legal principles to questions of how the law applies to real-time, real-world facts and controversies. The spring semester will require students to make their own determinations in a current legal controversy, such as by arguing a position in a case selected from the U.S. Supreme Court's current docket. Legal opinions and legislation are the primary texts; a required textbook on constitutional law is supplemental. Students who take the writing option must complete substantial written assignments in addition to weekly homework and oral presentations.",
    "subject": "Humanities",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ols11"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/omt10?source=/course-catalog-gateway",
    "code": "OMT10",
    "name": "Music Theory",
    "description": "Music Theory is a year-long course that examines the harmony and form of Western European music with a focus on the Baroque, Classical, and Romantic eras, approximately 1700–1900. This course also includes instruction in sight-singing and ear-training. It is recommended that students enter the course with the ability to read pitch and rhythm at a basic level. Other fundamentals such as recognizing all 24 key signatures; the natural, harmonic, and melodic scales; and compound and syncopated rhythm will be covered at the beginning of the first semester.",
    "subject": "Humanities",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "omt10"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/opd10?source=/course-catalog-gateway",
    "code": "OPD10",
    "name": "Portrait Drawing",
    "description": "A studio drawing course for high-school students of all skill levels with interest in portraiture. Students will learn the elements of drawing and composition with a focus on portrait drawing through demonstration, sequenced exercises, source information, and critiques using a variety of materials and techniques, including quick sketch, long and short poses, structure and proportion of the face, basic facial anatomy, contour/cross-contour, light and shadow, perspective, measurement, and positive/negative space. In addition, students will gain an appreciation and understanding of the role of portrait drawing through history as well as its aesthetic and cultural value.",
    "subject": "Humanities",
    "level": "High School",
    "semester": "Fall",
    "prerequisites": [],
    "slug": "opd10"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/opd11?source=/course-catalog-gateway",
    "code": "OPD11",
    "name": "Landscape Drawing",
    "description": "A studio drawing course for high-school students of all skill levels with interest in drawing natural and constructed landscapes. Students will learn the elements of drawing and composition with a focus on landscape through demonstration, sequenced exercises, source information, and critiques using a variety of materials and techniques to capture a variety of elements, including mountains, desert, forest, ocean, city, and the fantastic. In addition, effects of weather, changing light, rain/clouds, and geological and natural phenomena such as volcanoes and tornadoes are covered. Students will further explore the rich tradition of landscape in art as well as its cultural and artistic relevance throughout history.",
    "subject": "Humanities",
    "level": "High School",
    "semester": "Spring",
    "prerequisites": [],
    "slug": "opd11"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ops10?source=/course-catalog-gateway",
    "code": "OPS10",
    "name": "The Study of the Mind: Psychology, Neuroscience, and Philosophy",
    "description": "In this course, we will study the mind and human behavior by exploring emerging insights in the intersecting fields of neuroscience, psychology, and philosophy. We will draw on recent texts to examine issues involving language and mind, reasoning and biases, the unconscious, and abnormal psychology, as well as topics to be determined by student interests. As a result, the course will provide a conceptual foundation for students who are interested in all aspects of cognitive science.",
    "subject": "Humanities",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ops10"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/jh001?source=/course-catalog-gateway",
    "code": "JH001",
    "name": "Marginalized Voices: History of the US",
    "description": "This course will examine social, economic, and political developments in American history from the settlement of the colonies to the War on Terror. A primary focus of these explorations is to make visible those whose voices are often silent in mainstream textbooks such as women, African Americans, Native Americans, immigrants, and workers. Analysis of primary sources (e.g. letters, speeches, images, and maps) will push students to think critically about how history is written and how historical events are remembered. Students will also learn how to write a research paper, present research findings, and engage in debate on topics of note in U.S. history. Examination of historical and literary manuscripts specific to different periods in U.S. history will reveal for students the interdisciplinary nature of history.",
    "subject": "History",
    "level": "Middle School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "jh001"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/jh002?source=/course-catalog-gateway",
    "code": "JH002",
    "name": "Empires and World Civilizations to 1800",
    "description": "This course examines world history from the beginnings of the earliest civilizations in Mesopotamia to the formation of global networks in the eighteenth century. In addition to examining the unique features of individual civilizations, students will uncover the similarities and connections between seemingly distant and different societies. The course will often turn to discussions of empires to highlight these major patterns and linkages in world history. Analysis of historical documents in class discussions and written assignments will push students to think critically and craft original arguments about important issues from the ancient world to the dawn of the modern era.",
    "subject": "History",
    "level": "Middle School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "jh002"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oh005?source=/course-catalog-gateway",
    "code": "OH005",
    "name": "Revolutions and Rebellions",
    "description": "This course examines a series of interconnected revolutions that transformed the modern world. Building on skills acquired in earlier history and English courses, students will study the origins and key events of numerous rebellions including the American, French, and Haitian Revolutions along with other notable uprisings in modern history. The course will focus on how different social groups experienced and influenced political and economic upheavals. Students will examine a wide range of texts and sources, including artwork, literature, political pamphlets, and philosophical writings. This course will serve as preparation for advanced work in history.",
    "subject": "History",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oh005"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oh010a?source=/course-catalog-gateway",
    "code": "OH010A",
    "name": "Globalization and Imperial Exchange",
    "description": "This course examines critical developments in the long history of globalization and empire from the Hellenistic Era to the present day. In case studies students will work closely with primary sources to uncover the impacts of empires and explore how empires connected the world by facilitating the exchange of peoples, ideas, and goods across geographic and cultural barriers. Students will examine key moments in imperial history, such as the decline of the Roman Empire or the discovery of the New World, in which the rise and fall of empires resulted in major transformations in global history. Students will explore these convulsions through the perspective of diverse historical actors, ranging from missionaries and philosophers to nomads and pirates. Through these investigations students will learn how individuals, communities, and institutions adapted to and resisted imperial expansions and interconnections.",
    "subject": "History",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oh010a"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oh011a?source=/course-catalog-gateway",
    "code": "OH011A",
    "name": "American Culture and Society",
    "description": "This course surveys the history of the United States with a focus on the development of citizenship and civil rights in the nineteenth and twentieth centuries. Coursework will be divided into four units. In each unit, students will explore a different historical period, culminating in a case study of a major event (including the forced relocation of the Cherokee nation, the abolition of American slavery, and the modern civil rights movement). Throughout the year, we will consider the philosophical and ethical dimensions of historical inquiry. This course fulfills the U.S. history graduation requirement.",
    "subject": "History",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oh011a"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oh032?source=/course-catalog-gateway",
    "code": "OH032",
    "name": "Advanced History Research Seminar",
    "description": "In this seminar students will study major topics in contemporary American and global history, including but not limited to post-war geopolitical conflicts and their consequences, socio-economic transformations of recent decades, and the relationship between modern culture and politics. Students will engage critically with debates that exist among historians and learn how to conduct their own research, which will culminate in two research papers (one per semester) that thoroughly investigate particular historical issues or problems.",
    "subject": "History",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oh032"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/jla1a?source=/course-catalog-gateway",
    "code": "JLA1A",
    "name": "Latin 1A",
    "description": "The first year of this two-year sequence (comprising Latin 1A and Latin 1B) gives students the foundations of Latin grammar and the tools necessary to read and translate Latin passages. This course also introduces students to the study of Roman history, mythology, culture, and daily life through lectures and supplemental readings. Emphasis will be placed on a mastery of English grammar and syntax through the study of Latin. Students will complete chapters 1–12 of the Latin for the New Millennium, Level 1 textbook, and completion of Latin 1A and Latin1B will successfully prepare students for placement into Latin 2 at the high school level.",
    "subject": "Languages",
    "level": "Middle School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "jla1a"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/jla1b?source=/course-catalog-gateway",
    "code": "JLA1B",
    "name": "Latin 1B",
    "description": "The second year of this two-year sequence (comprising Latin 1A and Latin 1B) continues to give students the foundations of Latin grammar and the tools necessary to read and translate Latin passages. This course also introduces students to the study of Roman history, mythology, culture, and daily life through lectures and supplemental readings. Emphasis will be placed on a mastery of English grammar and syntax through the study of Latin. Students in this course will complete chapters 13–21 of the Latin for the New Millennium, Level 1 textbook. Successful completion of Latin 1B will prepare students for placement into Latin 2 at the high-school level.",
    "subject": "Languages",
    "level": "Middle School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "jla1b"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/och11?source=/course-catalog-gateway",
    "code": "OCH11",
    "name": "Chinese - Foundations",
    "description": "This beginning Chinese course is designed for students who have no previous experience with the Chinese language, and emphasizes practical speaking and listening skills. After an initial unit focusing on pronunciation, students begin rapidly acquiring vocabulary and sentence structures useful in common everyday situations. Students speak frequently in class, developing confidence in their ability to communicate. Students also learn several hundred basic characters, and to read and write sentences, dialogues, and short paragraphs. Various aspects of Chinese culture, history, and geography are introduced.",
    "subject": "Languages",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "och11"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/och12?source=/course-catalog-gateway",
    "code": "OCH12",
    "name": "Chinese - Intermediate",
    "description": "In this fast-paced intermediate level course students continue to rapidly acquire vocabulary essential for daily interaction, and sentence structures which enable them to understand and produce complex sentences, coherent narratives, brief comparisons, explain plans, and support a point of view. Students develop greater control over past, present,and future time frames. Class is conducted mostly in Chinese, with meaningful oral communication by and among students emphasized in every class period. Reading and culture studies are expanded to include traditional Chinese stories and poems. Students will be familiar with 800–1000 characters by the end of the second year.",
    "subject": "Languages",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "och12"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/och13?source=/course-catalog-gateway",
    "code": "OCH13",
    "name": "Chinese - Advanced Intermediate",
    "description": "In Advanced Intermediate Chinese students are engaged with readings, discussions, compositions, and projects based on issues encountered in present-day Chinese society and in student life. As they are learning more advanced and abstract vocabulary, students are also learning to write and present coherent and meaningful multipoint explanations, comparisons, and arguments in Chinese, and to critique each other's work. Students are exposed to an increasing variety of authentic language materials, and should be familiar with 1200–1400 characters by the end of the year. The class is conducted about 90% in Chinese, and students are expected to speak frequently.",
    "subject": "Languages",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "och13"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ola11?source=/course-catalog-gateway",
    "code": "OLA11",
    "name": "Latin - Foundations",
    "description": "In this accelerated introductory course, students will master the basics of Latin grammar and vocabulary and begin reading short Latin texts of increasing complexity. Students also study Roman history, mythology, culture, and daily life through lectures and supplemental readings. Understood goals: Mastery of key grammar and syntax together with vocabulary; understanding of key components of Roman history and culture.",
    "subject": "Languages",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ola11"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ola12?source=/course-catalog-gateway",
    "code": "OLA12",
    "name": "Latin - Intermediate",
    "description": "In this Intermediate Latin course, students complete their introduction to grammar and vocabulary in the fall semester and begin to focus on the translation of longer sections of Latin prose in the spring. Students continue to study Roman history and culture with a particular emphasis on Latin literature. Understood goals: Translation of original Latin and mastery of more complex grammar and syntax; deeper understanding of Roman history, particularly of the Republic.",
    "subject": "Languages",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ola12"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ola13?source=/course-catalog-gateway",
    "code": "OLA13",
    "name": "Latin - Advanced",
    "description": "In this advanced Latin course, students concentrate on refining their reading skills and tackling longer passages of prose and poetry with attention to accurate translation and in-depth literary analysis. Readings will be drawn from works by authors such as Cicero, Caesar, Catullus, Ovid, Horace, Plautus, Pliny, and Seneca. Understood goals: Translation of larger passages of original Latin, including poetry; refinement of skills in literary analysis and essay writing; deeper understanding of Roman literary history.",
    "subject": "Languages",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ola13"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/osp11?source=/course-catalog-gateway",
    "code": "OSP11",
    "name": "Spanish - Foundations",
    "description": "This course is designed for students with no previous experience with Spanish or with very basic proficiency. Students are introduced to and develop mastery of basic Spanish language grammar and conversation skills, in a manner that builds confidence in language learning and learning in general. Also covered in this course are topics on language, culture, history of science, and mythology where Hispanic peoples and landscapes played an important role. While learning and practicing Spanish language skills, students are encouraged to share their knowledge and talents in other areas and fields of study.",
    "subject": "Languages",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "osp11"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/osp12?source=/course-catalog-gateway",
    "code": "OSP12",
    "name": "Spanish - Intermediate",
    "description": "This course will help students attain proficiency in an interactive setting by building on the basic Spanish language skills acquired in Spanish 1. Leveraging Spanish 1 concepts, Spanish 2 students learn to communicate more confidently about themselves and their hopes and fears, as well as about topics beyond their own lives both in formal and informal situations. Students will also deepen their knowledge of Spanish-speaking regions and cultures by being exposed to literary texts, poetry, history, politics, current events as well as key topics/debates common to contemporary cultural issues (e.g., race and ethnicity, gender, family, and globalization). Throughout the course, students are encouraged to find cultural relationships between the Hispanic world and the United States and between the production of the Spanish language and other fields of study of their own interest.",
    "subject": "Languages",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "osp12"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/osp13?source=/course-catalog-gateway",
    "code": "OSP13",
    "name": "Spanish - Advanced",
    "description": "This course is designed for students who wish to become fluent in Spanish across interpersonal, interpretive, and presentational communication modes. Students become successful at listening to, describing, narrating, and presenting complex information and writing cohesive and coherent essays on a variety of topics. They greatly expand their understanding of local and global perspectives in Spanish and Hispanic cultures through in-depth study of history, literature, poetry, art, music, and current events.",
    "subject": "Languages",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "osp13"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/och14?source=/course-catalog-gateway",
    "code": "OCH14",
    "name": "Chinese - Advanced",
    "description": "Fourth-year Chinese is an advanced course in which students use a wide variety of text and audio-visual materials to enhance their learning of Chinese language as well as traditional and modern Chinese culture. The class is conducted entirely in Chinese and students are expected to speak frequently with others, express opinions, present arguments, make historical and cultural comparisons, producing non-rehearsed responses to the topics, text, pictures or video under discussion. Students continue to acquire vocabulary, characters, and advanced grammar structures, and to sharpen listening, speaking and composition skills. Extensive reading assignments improve students' reading ability, while broadening their knowledge of Chinese culture. Students research and write essays or create presentations on a variety of topics such as environment, healthy lifestyle, gender equality, urban-rural differences, money management, travel, social media, as well as other subjects which interest them.",
    "subject": "Languages",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "och14"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ola14?source=/course-catalog-gateway",
    "code": "OLA14",
    "name": "Latin Prose and Poetry",
    "description": "This course provides a focused, advanced study of Latin literature divided into one semester of Roman poetry and one semester of Roman prose. This seminar-style course will include reading in unadapted Latin on a particular author or theme, contextual reading in translation, and secondary scholarship. Student assessment will include grammar quizzes, translation exams, essay components, and creative projects. The course is structured such that each semester is modular, and may be replaced or modified from year to year per instructor discretion.",
    "subject": "Languages",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ola14"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/osp14?source=/course-catalog-gateway",
    "code": "OSP14",
    "name": "Spanish - Literature, Film, and Culture",
    "description": "This advanced Spanish course will explore the topic of cultural diversity in the Iberian Peninsula and Latin America through analysis of images (video, film, documentaries, art, music) and a variety of texts (e.g., poetry, short stories, essays, articles). Students will study texts and visual culture in order to analyze characteristics of Iberian and Latin American cultures, histories, and peoples. By employing strategies for creating a meaningful education, students will be able to demonstrate their proficiency in Spanish in each of the three modes of communication: interpersonal, interpretive, and presentational. Language skills will be developed through oral presentations, research projects, and written reflections on visual material, literary, and non-literary texts. Upon completion of the course, students will have developed a broader knowledge of Hispano-American societies and histories, will have greatly enriched their vocabulary, and will be able to grasp linguistic and grammatical structures that enable them to produce, comprehend, and acquire a variety of written, spoken, and aural materials.",
    "subject": "Languages",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "osp14"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/jm007?source=/course-catalog-gateway",
    "code": "JM007",
    "name": "Prealgebra",
    "description": "This course provides students with the solid foundation in arithmetic, geometry, measurement, and related topics required for success in Beginning Algebra. Specific topics include arithmetic operations on integers and rational numbers; variables, expressions, and equations; area, volume, and the Pythagorean Theorem; ratio, proportion, and percent; measurement and graphing; and solving application problems.",
    "subject": "Mathematics",
    "level": "Middle School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "jm007"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/om011?source=/course-catalog-gateway",
    "code": "OM011",
    "name": "Beginning Algebra",
    "description": "For students who previously have had little or no formal exposure to algebra. Primary topics include: the elementary structure and language of real numbers, understanding and manipulating algebraic expressions including polynomials, radical expressions, and rational expressions, solving linear and second-degree equations, understanding inequalities and systems of equations. Emphasis is placed on word problems and graphing.",
    "subject": "Mathematics",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "om011"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/om012?source=/course-catalog-gateway",
    "code": "OM012",
    "name": "Intermediate Algebra",
    "description": "For students with previous exposure to algebra but not sufficient mastery for Precalculus with Trigonometry (OM013). This course reviews and extends the topics of beginning algebra: linear equations and inequalities, absolute value, quadratic inequalities, roots and exponents, and systems of equations. Other topics include: exponential and logarithmic functions, conic sections, and arithmetic and geometric sequences.",
    "subject": "Mathematics",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "om012"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/om013?source=/course-catalog-gateway",
    "code": "OM013",
    "name": "Precalculus with Trigonometry",
    "description": "For students who have had substantial previous exposure to algebra. The course builds on and deepens topics from Beginning Algebra (OM011) and Intermediate Algebra (OM012). Functions and their properties are studied in detail, including composition and inverses. Other topics include: understanding functions in context, the algebra of exponential and logarithmic functions, techniques of graphing, sequences and series, polar and parametric equations, the binomial theorem, combinatorics, proof by induction, and analytic geometry. Approximately half of the course focuses on trigonometry and its applications.",
    "subject": "Mathematics",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "om013"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/om015?source=/course-catalog-gateway",
    "code": "OM015",
    "name": "Geometry and Foundations of Proof",
    "description": "This course combines the traditional deductive approach to geometry in the tradition of Euclid with the contemporary computational and discovery approaches. Primary topics include: logic, congruence of polygons, inequalities, similarity, properties of circles, area of plane figures, surface area and volume of solids, basic trigonometry, and coordinate geometry.",
    "subject": "Mathematics",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "om015"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/om045?source=/course-catalog-gateway",
    "code": "OM045",
    "name": "Single-Variable Calculus",
    "description": "This comprehensive course explores the fundamental topics of differential and integral calculus of a single variable, including limits, continuity, rates of change, differentiation, integration, introductory differential equations, infinite sequences and series, convergence and divergence of series, power series, and Taylor series and polynomials and their applications. Throughout the course, students will approach calculus using analytic, graphical, algorithmic, and numerical points of view, with an emphasis on rigorous problem-solving and high-level development of the mathematical content. Additionally, students will consider the historical development of calculus, and will form connections between the classical theory and modern applications of calculus. This course serves as a challenging and engaging course in single-variable calculus, and prepares students for more advanced work in mathematics. OM045 firmly situates calculus in the broader narrative of mathematical exploration, and fosters connections between students' previous coursework in mathematics, the discovery of calculus and the analysis of functions, and higher-level mathematics.",
    "subject": "Mathematics",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "om045"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/om050?source=/course-catalog-gateway",
    "code": "OM050",
    "name": "Advanced Problem Solving and Proof Techniques",
    "description": "This semester-long course in theoretical mathematics develops students' facility with abstract conceptual work and prepares students for more advanced math courses relying on rigorous proofs. Students gain experience analyzing complex problem situations, formulating solutions, rigorously justifying arguments, and presenting mathematical reasoning clearly and effectively, both orally and in writing. Course topics include general guidelines for analyzing problems, proving conditional and biconditional statements, working with negations, proof by contradiction, problem-solving heuristics, understanding quantifiers, mathematical induction, the construction method, working with nested quantifiers, and special proof techniques. The course focuses on practical problem-solving and proof-construction techniques that will be invaluable in many university-level mathematics courses.",
    "subject": "Mathematics",
    "level": "High School",
    "semester": "Fall or Spring",
    "prerequisites": [],
    "slug": "om050"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/om061?source=/course-catalog-gateway",
    "code": "OM061",
    "name": "Statistics and Data Analysis",
    "description": "Statistics is an essential part of many disciplines in science and humanities. The purpose of this year-long course is to provide students with a basic understanding of statistics, giving them the ability to describe various populations, and draw inferences about them. It should also sharpen individual intuition about how to read data, interpret data, and judge others' claims about data. This course should be useful to a wide variety of students, preparing them for more advanced courses, as well as aiding in both academic and professional advancement. In this course students will investigate methods and concepts in statistics, covering the following broad themes: exploring and presenting data, sampling and experimentation, anticipating patterns, and statistical inference. The skills to be developed include the ability to characterize population data intuitively for oneself and others, to draw conclusions and novel inferences from population data, to check assumptions of others' claims and debug their reputed \"facts\", to look for causation while controlling for confounding effects, and to demystify the process of inquiry into what is not known. Please note that students who have taken OMSB9, Methodology of Science – Biology, may consider this course as a continuation of the elementary statistics studied in the course.",
    "subject": "Mathematics",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "om061"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/om065?source=/course-catalog-gateway",
    "code": "OM065",
    "name": "Data Science",
    "description": "This class will introduce students to a variety of computer algorithms and the statistical models they represent in order to perform prediction or classification. Models covered include: k-nearest neighbors, linear and logistic regression, principal component analysis, k-means and hierarchical clustering, trees, random forests and support vector machines. The class discusses the fundamentals of experimental design, model validation, optimization, and comparison. Other topics include: quantile regression, resampling methods and introduction to Bayesian statistics. Students will learn to prepare and use datasets from the natural and social sciences to formulate and answer research questions relevant to their own lives. This class includes substantial use of statistical software.",
    "subject": "Mathematics",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "om065"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/um106?source=/course-catalog-gateway",
    "code": "UM106",
    "name": "Complex Analysis",
    "description": "Theory of differentiation and integration of functions of a complex variable. Topics include a formal introduction to the complex numbers and complex plane, theory of analytic functions, the Cauchy integral formula, power series and Laurent series, calculation of residues and applications, conformal mapping, and harmonic functions. Students will develop the geometric interpretation of complex functions, and use the Residue Theorem to evaluate definite integrals of real and complex functions.",
    "subject": "Mathematics",
    "level": "University",
    "semester": "Spring",
    "prerequisites": [],
    "slug": "um106"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/um115?source=/course-catalog-gateway",
    "code": "UM115",
    "name": "Real Analysis",
    "description": "This course covers the development of analysis of functions of a real variable, including rigorous proofs of results in single-variable calculus. Topics include formal treatment sequences and subsequences, series limits, pointwise and uniform continuity, sequences and series of functions, pointwise and uniform convergence, differentiation and integration of power series, the mean value theorem, Taylor expansions, the Riemann integral, and the fundamental theorem of calculus. Students gain an understanding of basic point set topology, with a focus on the theory and structure of compact and connected sets. This course involves significant analysis and construction of mathematical proofs.",
    "subject": "Mathematics",
    "level": "University",
    "semester": "Fall",
    "prerequisites": [],
    "slug": "um115"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/um150?source=/course-catalog-gateway",
    "code": "UM150",
    "name": "Multivariable Calculus",
    "description": "Developed in consultation with the Stanford Math Department, Multivariable Calculus offers an innovative year-long integrated treatment of Calculus in several variables together with linear algebra. This approach leads to a more comprehensive understanding of multivariable Calculus, including the geometry of Euclidean spaces, limits, partial derivatives, and optimization, along with modern matrix decomposition methods which have become the preferred method for solving large systems of linear equations in practice. This leads to a thorough presentation of integration and vector integral calculus, including volumes, iterated integrals, change of variables, applications to probability, Green's Theorem, Stokes' Theorem, and Gauss's Theorem. We also build knowledge of modern mathematical techniques crucial for applications to engineering, computer science, machine learning, economics, chemistry and other fields. These include the chain rule; least squares and linear regression for data fitting, including a more general study of n-space, all key tools necessary in modern data science; Markov chains for applications to probability, chemistry, population dynamics; singular value decomposition, which is a core idea behind image compression and other modern data-intensive work; and optimization, which is central to economics and engineering alike and is the culmination of both the Calculus and linear algebra.",
    "subject": "Mathematics",
    "level": "University",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "um150"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/um152?source=/course-catalog-gateway",
    "code": "UM152",
    "name": "Number Theory",
    "description": "This one-semester introductory course in number theory begins with fundamental properties of the integers, including divisibility, the greatest common divisor, prime numbers, Euclid's Lemma, and the Euclidean Algorithm. Students will develop a deep understanding of modular arithmetic, the Chinese Remainder Theorem, Fermat’s Little Theorem, and the Euler-Fermat Theorem. Students will explore classical number-theoretic problems including solving Diophantine equations, quadratic residues, and primitive roots. Throughout, we will emphasize both theoretical results and practical applications, particularly in computer science and cryptography, where number theory plays a crucial role in encryption, coding theory, and algorithm design. Students will also gain experience reading and writing mathematical proofs, developing their ability to construct rigorous arguments and communicate mathematical ideas effectively.",
    "subject": "Mathematics",
    "level": "University",
    "semester": "Spring",
    "prerequisites": [],
    "slug": "um152"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/um157?source=/course-catalog-gateway",
    "code": "UM157",
    "name": "Logic in Action: A New Introduction to Logic",
    "description": "Fall only Logic provides an essential methodological framework of reasoning connecting a wide variety of disciplines in the humanities and sciences, including philosophy, mathematics, computer science, linguistics, cognitive science, and economics. This course will introduce students to logic and its applications highlighted by recent developments in these fields. We will use the open source logic course Logic in Action, which has been developed by the international team of Prof. Johan van Benthem at Amsterdam, and taught in many places, including Stanford, Amsterdam, Beijing, Seville, etc.",
    "subject": "Mathematics",
    "level": "University",
    "semester": "Fall",
    "prerequisites": [],
    "slug": "um157"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/um160?source=/course-catalog-gateway",
    "code": "UM160",
    "name": "Discrete Mathematics",
    "description": "This semester-long course develops the fundamental theory, structures, and techniques of discrete mathematics. Discrete mathematics is an extremely broad and diverse subject, with a variety of connections to other branches of mathematics (including number theory, abstract algebra, and others), as well as applications to fields outside of mathematics (including computer science, optimization, operations research, and engineering). Topics that we will explore in this course include enumerative combinatorics, partitions, generating functions, principles of inclusion and exclusion, induction and recursion, and introductory graph theory. This challenging course provides an ideal environment for students to improve and deepen their abilities to observe patterns, engage in mathematical reasoning, formulate conjectures, and construct rigorous mathematical proofs. We will learn how to prove results and solve problems that may be somewhat different than those that students have seen previously, and we will develop the foundations and mathematical maturity necessary to be broadly successful in higher-level mathematics (and other fields).",
    "subject": "Mathematics",
    "level": "University",
    "semester": "Fall",
    "prerequisites": [],
    "slug": "um160"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/um170?source=/course-catalog-gateway",
    "code": "UM170",
    "name": "Geometry of Numbers",
    "description": "In this semester-long course, students will explore, discover, and prove fundamental properties of the lattice plane. We will formulate and prove a necessary and sufficient condition for constructing a regular lattice polygon with n sides and, along the way, will discover a range of unexpected and interesting properties of lattice point geometry. These include results on the algebraic structure of the lattice plane, Pick's Theorem, Blichfeldt's Theorem, Minkowski's Theorem, and a variety of others. This course provides a rich opportunity for students to discover the many, and often surprising, interrelations between seemingly disparate areas of mathematics. We will engage rigorously with deep mathematical concepts, including a number of topics not typically studied at the secondary or undergraduate levels. This culminating course will involve work in a range of mathematical fields, including number theory, linear algebra, graph theory, and abstract algebra. Students will participate actively in the mathematical development process, beginning with questions that are easy to state and investigate empirically, and ultimately reaching open areas of research in mathematics.",
    "subject": "Mathematics",
    "level": "University",
    "semester": "Spring",
    "prerequisites": [],
    "slug": "um170"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/um51a?source=/course-catalog-gateway",
    "code": "UM51A",
    "name": "Linear Algebra",
    "description": "A proof-based treatment of linear algebra. Topics include a theoretical exploration of matrix properties including building linear algebra from first principles, including non-commutativity, the properties of inverses, and the structure and organization of the solutions of linear systems. The class builds up to the understanding of the fundamental theorem of linear algebra through a set of equivalent statements about matrix properties. This class requires students to be familiar with mathematical proof writing.",
    "subject": "Mathematics",
    "level": "University",
    "semester": "Fall",
    "prerequisites": [],
    "slug": "um51a"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/um53a?source=/course-catalog-gateway",
    "code": "UM53A",
    "name": "Differential Equations",
    "description": "Basic techniques and methods for solving ordinary differential equations. Topics: linear, separable, and exact equations, existence and uniqueness theorems, difference equations, basic theory of higher order equations, variation of parameters, undetermined coefficients, series solutions, Laplace transform, systems of equations.",
    "subject": "Mathematics",
    "level": "University",
    "semester": "Spring",
    "prerequisites": [],
    "slug": "um53a"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oec11?source=/course-catalog-gateway",
    "code": "OEC11",
    "name": "Microeconomic Theory",
    "description": "This course provides a foundation of microeconomic theory and its applications. Students will explore supply and demand functions, including market equilibrium, elasticities, and consumer and producer surplus. Students study how supply and demand functions are impacted by external changes, and several different market structures are introduced to review their impact, including financial and labor markets as well as monopolies and oligopolies. Theories of consumer choice are explored, including utility theory and prospect theory, as well as other ideas emerging from behavioral economics. The theory of the firm is also introduced, detailing issues impacting production and supply. With this foundation, students explore the impact of outside influences on the market, including globalization, externalities such as pollution, and the impact of risk aversion; this section emphasizes the mechanisms which policy makers can use to address situations deemed suboptimal if market forces are left unchecked.",
    "subject": "Mathematics",
    "level": "High School",
    "semester": "Fall",
    "prerequisites": [],
    "slug": "oec11"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oec15?source=/course-catalog-gateway",
    "code": "OEC15",
    "name": "Advanced Topics in Microeconomics",
    "description": "Advanced Topics in Microeconomics is a semester-long course that explores a variety of topics in microeconomics at the post-AP or intermediate level while engaging students in the basic principles and practices of economic research. Students will gain a deeper understanding of microeconomics topics which may include the theoretical underpinning of supply and demand, game theory, bargain theory, the principal-agent problem, Pareto optimality, general equilibrium, experimental and empirical study design, and interpretation of data. Students will apply their knowledge of these topics by composing a significant research paper on a topic of their own choosing.",
    "subject": "Mathematics",
    "level": "High School",
    "semester": "Spring",
    "prerequisites": [],
    "slug": "oec15"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/jcs01?source=/course-catalog-gateway",
    "code": "JCS01",
    "name": "Computational Thinking and Computer Science",
    "description": "An introduction for middle school students to computational thinking and problem solving through computer programming, including identifying abstractions and developing simple algorithms to solve abstract problems. The course teaches students the basic principles on how to analyze problems, decompose large problems into smaller problems, and systematically develop logical instructions to solve them. Students are introduced to basic computer hardware and programming concepts including an overview of key computer hardware components such CPU, memory, storage, and peripheral devices; how to write simple programs using the Python or similar programming language; and, implications of computers in the current society and the social, political, economic, and ethical issues confronting individuals and society.",
    "subject": "Computer Science",
    "level": "Middle School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "jcs01"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ocs10?source=/course-catalog-gateway",
    "code": "OCS10",
    "name": "Programming in C++: Techniques and Algorithms",
    "description": "This course introduces the fundamentals of C++ Programming including basic syntax, data types, expressions, control statements, functions, arrays, searching and sorting algorithms, recursion, file I/O, abstract data types, and the interaction between the compiler and the hardware. The programming exercises are oriented towards learning how to construct an efficient algorithm to solve a problem and include computing the solutions of quadratic equations, finding prime or perfect numbers in a given range, and processing words in a passage of text. The final project at the end of the year allows students to develop a more advanced program. Some of the projects include designing: tic-tac-toe, a postfix notation calculator, and the game of life.",
    "subject": "Computer Science",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ocs10"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ocs20?source=/course-catalog-gateway",
    "code": "OCS20",
    "name": "Object Oriented Programming and Design",
    "description": "This course takes a deep-dive into object oriented programming, a modern programming paradigm for large-scale software design. Students will work on meaningful projects as they explore topics such as inheritance, classes, interfaces, and composition. Computation is ubiquitous, and as such, students will get a chance to work on an open-ended project in an interdisciplinary field of their choosing. Some projects in the past have included 2-D games and simulations, fractal and Mandelbrot-Set generators, melody and music creation, maze generation and solving, and mapping disease transmission on a world map. Students in this course will focus on learning object-oriented design principles, testing and debugging, and best coding practices. The language used in the course is Java, which is well known for being a platform-independent language that is highly portable from machine to machine. Expect spirited discussions as we compare and contrast Java with C++ and other languages. In the process, students will come away with a better understanding of programming language design and theory.",
    "subject": "Computer Science",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ocs20"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ocs25?source=/course-catalog-gateway",
    "code": "OCS25",
    "name": "Data Structures and Algorithms in Java",
    "description": "This year-long course continues and deepens students' understanding and practice of object oriented programming. Students are expected to have familiarity with programming in Java at the at the Object Oriented Programming level. Core topics in the context of the Java programming language include practical implementations of fundamental and more advanced data structures (linked lists, hash encoded storage, binary search tree and red-black trees, algorithms for organizing and manipulating data - including sorting, searching, and traversal algorithms), and time complexity of algorithms in a problem-solving oriented context. In-depth exploration of graph traversal algorithms (depth first search, breadth first search, shortest paths, and connected components) and string processing algorithms (substring search and string compression) is also included. Much of the course is project-based, with assignments stressing the design of classes and algorithms appropriate to a particular problem.",
    "subject": "Computer Science",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ocs25"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ocs35?source=/course-catalog-gateway",
    "code": "OCS35",
    "name": "Advanced Topics in Computer Science: Computer Systems",
    "description": "This course is an introduction to computer architecture and low-level programming. It describes the hardware architecture of the modern computer and its key components such as the central processing unit (registers and the arithmetic and logic unit), cache structure, memory, and storage, and the basic functions of the operating system including process scheduling and memory management. The course teaches students how to write programs with an understanding of how high-level instructions are executed on the modern CPU, their equivalent low-level representations, the inherent limitations of the binary number systems, and the resulting errors in arithmetic computations. It also develops the concept of low-level programming using C and x86-64 as assembly languages.",
    "subject": "Computer Science",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ocs35"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/jp001?source=/course-catalog-gateway",
    "code": "JP001",
    "name": "Inquiry-based Physics",
    "description": "In this year-long course, students explore the fundamentals of physics through experimentation and discussion guided by the instructor. Through this engaging process, the instructor poses questions and counterexamples until the students reach a consensus in their experimentation, after which concepts are formally summarized. This course provides a strong foundation for work in more advanced science courses by introducing a number of basic skills, including significant figures, interpretation of graphs, problem solving, and the basics of laboratory work. Concepts covered include: fundamentals and nature of science, measurement, kinematics, Newtonian dynamics, conservation of energy and momentum.",
    "subject": "Science",
    "level": "Middle School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "jp001"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/js002?source=/course-catalog-gateway",
    "code": "JS002",
    "name": "Foundations in Science: Energy and Matter",
    "description": "This year-long seminar-style course introduces students to the concepts that provide the foundation for physics, chemistry, and biology. Students will explore energy and matter, two ideas that unify the sciences, and examine these core concepts from the perspective of each discipline. Students will use an inquiry-based approach with an emphasis on acquiring the background knowledge and perspective to develop research problems and will practice these skills through experimentation at home. Through exploration of the central themes of the course, students will additionally become familiar with the basic principles of scientific reasoning. The primary goal of the course is to provide students with a well informed introduction to science that prevents common misconceptions and that prepares students for high-school laboratory sciences.",
    "subject": "Science",
    "level": "Middle School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "js002"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oastr?source=/course-catalog-gateway",
    "code": "OASTR",
    "name": "Life in the Cosmos",
    "description": "This year-long astrobiology course situates Earth within a Universe that is vast and strange. To inform the likelihood of finding life on other habitable planets, we investigate the conditions under which life arose on Earth. We engineer prototype solutions to some of the hurdles we will encounter as a new space-faring civilization. In the process of doing so, students will master the fundamentals of scientific measurement, engage with principles of design, and take part in citizen science initiatives pertaining to areas of current NASA research. In addition, we analyze themes of Sun, Moon, and stars in history, philosophy, and literature, reading and writing our own stories about the stars. Finally, we consider the technical, biological, ethical, and societal challenges associated with solar system exploration and planning a future for human life beyond Earth.",
    "subject": "Science",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oastr"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oastr1?source=/course-catalog-gateway",
    "code": "OASTR1",
    "name": "Astrophysics",
    "description": "This semester-long course introduces students to historical and modern astrophysics. Topics include the nature of light, the atom, telescopes, and orbits. In addition, students learn about the life cycles of stars, including an introduction to dark matter and black holes. The course ends with cosmology, including the rate of expansion of the Universe, as part of which we calculate the Hubble constant from measurements of galaxy images. Occasional programming exercises familiarize students with some Python modules that are used in astronomical research, though no background programming knowledge is assumed. Engaging with current research, we examine the modern astronomical data used to search for and categorize the thousands of planets outside our solar system, and the considerations involved in the ongoing search for extraterrestrial life.",
    "subject": "Science",
    "level": "High School",
    "semester": "Fall",
    "prerequisites": [],
    "slug": "oastr1"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oastr2?source=/course-catalog-gateway",
    "code": "OASTR2",
    "name": "Astronomy Research Seminar",
    "description": "In this semester-long course, students investigate topics of current astronomical research. Using robotic telescopes from the Las Cumbres Observatory and the Skynet Robotic Telescope Network, we collect images to analyze in teams. Based on their analysis, students write a paper for submission to an academic journal.",
    "subject": "Science",
    "level": "High School",
    "semester": "Spring",
    "prerequisites": [],
    "slug": "oastr2"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oc005?source=/course-catalog-gateway",
    "code": "OC005",
    "name": "Principles of Chemistry",
    "description": "Principles of Chemistry is a year-long seminar-style course that introduces the fundamental language, ideas, and tools used in the study of chemistry. This challenging introductory high school chemistry course covers key topics such as chemical nomenclature, stoichiometry, the periodic table, chemical bonding, equilibrium, solution chemistry, thermochemistry, and common laboratory practices. Emphasis is placed on the use of chemistry in the natural world, the physical world, and in our daily lives. The course fosters skills necessary to describe chemical processes and behaviors and to solve numerical and verbal problems in chemistry. Through at-home lab work, students learn useful chemistry laboratory techniques, gain the ability to formulate experimental questions, design scientific experiments, effectively articulate scientific findings, and strengthen understanding of course material. Upon completion, students will have a solid foundation in chemistry and will be prepared for more advanced work in biology and chemistry.",
    "subject": "Science",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oc005"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/op005?source=/course-catalog-gateway",
    "code": "OP005",
    "name": "Principles of Physics",
    "description": "Principles of Physics is a year-long, algebra-based, course designed to develop a strong conceptual understanding of physical principles. Students cultivate their understanding of physics through inquiry-based investigations as they explore these topics: kinematics, dynamics, circular motion and gravitation, energy, momentum, simple harmonic motion, torque, rotational motion, thermodynamics, electrical force, field, and potential; electric circuits, magnetism and electromagnetic induction and geometric optics.Throughout the course, emphasis is placed on modeling of physical system at various levels and through multiple representations (schematic, mathematical, computational, etc.). Lab work, a combination of at-home labs and virtual labs, is expected to encourage further exploration of physical phenomena while reinforcing their underlying concepts developed through group discussion sessions. Emphasis is placed on developing a student's communication skills. Completion of Intermediate Algebra (OM012) is required; co-enrollment in pre-calculus is recommended. Knowledge of geometry, trigonometry and solving systems of equations is assumed.",
    "subject": "Science",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "op005"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/os005?source=/course-catalog-gateway",
    "code": "OS005",
    "name": "Environmental Science",
    "description": "Environmental Science is a year-long course that introduces students to fundamental topics in earth and environmental science, and emphasizes their connection to everyday life. Topics include: earth's history and geology, plate tectonic theory, global climates and biomes, biodiversity and ecosystem services, biogeochemical cycling, evolution and human history, modern environmental impacts, global climate change, and alternative energy. Students complete experiential labs that prompt them to explore their local environments or dig into favorite topics in greater depth. Lab work helps students build scientific research and communication skills through mapping, graphing, analyzing data, researching the scientific literature, and presenting findings in class. This course is ideal for students who are excited to learn about environmental science and/or want to take a high school level science course in preparation for Principles of Physics or Principles of Chemistry.",
    "subject": "Science",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "os005"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ob010a?source=/course-catalog-gateway",
    "code": "OB010A",
    "name": "Unity & Diversity of Biological Systems",
    "description": "Unity & Diversity of Biological Systems is a year-long seminar course that covers college-level introductory biology topics including molecular, cellular biology and genetics; anatomy, physiology, and diversity of plants, animals, and microbes; and ecology and evolution. Emphasis will be placed on the themes that unify biology including regulation of biological processes, energy transfer, continuity and change, evolution, the relationship between structure and function, emergent properties, interdependence in nature, the scientific process, and the relevance of biology in our everyday lives. Through virtual and at-home lab work (kit required), students will learn useful biological techniques, gain the ability to design scientific experiments, effectively communicate results, and strengthen their knowledge of material discussed in class.",
    "subject": "Science",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ob010a"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/oc010a?source=/course-catalog-gateway",
    "code": "OC010A",
    "name": "Analytical & Organic Chemistry",
    "description": "Analytical & Organic Chemistry is a year-long exploration of advanced topics in chemistry. The class explores quantum models of atomic structure, covalent bonding, molecular orbital theory, intermolecular forces, condensed states, crystallography, spectroscopy, solution chemistry, multi-step reaction mechanisms, rate law determination, and equilibrium systems. Acid-base systems, how free energy drives reaction, and electro-chemical cells are discussed. That foundation is used to begin an introduction to the structures, properties, and reactions of organic substances. Second semester topics include organic nomenclature, conformational analysis, isomerism, functional group conversion, organic reaction mechanisms, and synthetic design. Throughout the year students accomplish hands-on experiments using a custom built at-home lab kit and apply computational chemistry techniques for structural determination, reaction modeling, and spectroscopic analysis (NMR, IR, and UV-Vis).",
    "subject": "Science",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "oc010a"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/op010a?source=/course-catalog-gateway",
    "code": "OP010A",
    "name": "Analytical Physics: Mechanics and Electricity & Magnetism",
    "description": "Mechanics and Electricity & Magnetism is a year-long calculus-based physics course designed to be equivalent to an introductory university-level physics course. The fall semester of this course covers mechanics, including study of kinematics, force, circular motion, momentum, energy, rotation, gravitation, and simple harmonic oscillation. The main focus of the spring semesters is on electricity and magnetism, including exploration of electrostatic force, electric fields, electric potential, simple circuits, magnetic fields, induction, Maxwell's equations, and electromagnetic waves. By completing at-home and virtual lab work, students reinforce their understanding of concepts, gain hands-on experimentation experience, and develop their written communication skills.",
    "subject": "Science",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "op010a"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ob011?source=/course-catalog-gateway",
    "code": "OB011",
    "name": "Advanced Topics in Biological Research",
    "description": "Advanced Topics in Biological Research is a year-long seminar course that explores a variety of biological concepts in depth through discussion of scientific research. Topics are chosen from the breadth of the discipline and build on the foundation of knowledge acquired in Unity & Diversity of Biological Systems (OB010A). Students study molecular and cell biology, genetics, plant biology, medicine, evolution, and ecology by reading both current and seminal research publications and discussing these works as a group. Not only do students gain an appreciation of relevant research topics in modern biology, but they also learn about valuable research tools and the skills necessary to understand the frontiers of the science. This course is also offered as a full-credit writing option (OB012).",
    "subject": "Science",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ob011"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ob012?source=/course-catalog-gateway",
    "code": "OB012",
    "name": "Advanced Topics in Biological Research: Writing Option",
    "description": "Advanced Topics in Biological Research: Writing Option is a companion course to OB011. Students choosing the Writing Option will be engaged in the discussions of OB011 and additionally discuss the forms and styles of science writing including primary research publications, reviews, and science journalism. Students will apply their knowledge of these forms by composing a review article or significant research paper on the modern biological research topic of their choosing. Throughout the writing process, students will learn the skills necessary to independently and deeply explore scientific research literature and the process of writing, editing, and reviewing a lengthy written piece including peer-evaluation.",
    "subject": "Science",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ob012"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/ob015?source=/course-catalog-gateway",
    "code": "OB015",
    "name": "Neuroscience",
    "description": "Neuroscience is a year-long course that covers college-level neuroscience concepts and includes virtual and table-top investigations. Fall semester will start with examination of cellular neuroanatomy and a thorough understanding of the electrical properties of ion channels, neurons, and synapses. As we start to understand networks of neurons, we will investigate sensory and motor systems, culminating in the comparative anatomy of nervous systems and brain structure and function. Spring semester will look at higher functions, including learning and memory, language, emotions, and mood. We will follow human brain development from birth through the second round of changes in adolescence. We will also address brain gender and loss of brain function through addiction and disease. Students will research, present, and lead discussion on the neurological disorder or phenomenon of their choice, relating the condition to fundamental structures that we studied at the start of the class.",
    "subject": "Science",
    "level": "High School",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "ob015"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/up055?source=/course-catalog-gateway",
    "code": "UP055",
    "name": "Light and Heat",
    "description": "The course is an introduction to university-level thermodynamics and optics. Topics include statistical nature of many-body systems, phase space, multiplicity of states and its connection to thermodynamic variables, equipartition theorem, entropy, and the three laws of thermodynamics, electromagnetic waves, wave equations, Maxwell's equations as it pertains to light, ray optics, lens systems, interference and diffraction through complex representation of plane wave states. A small number of at-home demonstrations will provide hands-on exposure to particular thermodynamic and optical phenomena. Elements of multivariable calculus and linear algebra will be utilized.",
    "subject": "Science",
    "level": "University",
    "semester": "Fall",
    "prerequisites": [],
    "slug": "up055"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/up070?source=/course-catalog-gateway",
    "code": "UP070",
    "name": "Modern Physics",
    "description": "An introduction to the two pillars of modern physical theory. The relativity segment includes geometrical structure of spacetime as examined through spacetime diagrams, causal diamonds, and the metric equation, relativistic dynamics and the nature of mass, energy, and momentum, elementary introduction to general relativity. The quantum mechanics segment includes the need for a new theory, quantization of light, Hilbert space structure of qubits utilizing polarization as the physical substrate, multiparticle states, entangled states, incompatible observables, uncertainty relations, Bell inequalities, and the Schrödinger equation.",
    "subject": "Science",
    "level": "University",
    "semester": "Spring",
    "prerequisites": [],
    "slug": "up070"
  },
  {
    "source_url": "https://familygateway.ohs.stanford.edu/courses/2025/fallspring/up135?source=/course-catalog-gateway",
    "code": "UP135",
    "name": "Introduction to Quantum Computing",
    "description": "Introduction to Quantum Computing is an advanced course preparing students for this rapidly growing area that endeavors to leverage quantum theory to perform computations exponentially faster than classical means. This course will build on the foundational aspects of quantum theory covered in Modern Physics (UP070). Background topics in mathematics and computation will be introduced in parallel with the exploration of quantum algorithms. Sundry relevant topics will be discussed as well, including physical implementations, history of QC, companies and labs exploring QC, and recent advances. Aspects of set theory, group theory, number theory, linear algebra, probability and statistics will be utilized in this course. It has been recognized that there is a great need for researchers and workers skilled in quantum technologies and information, what has been called a future \"quantum workforce.\" The successful student in UP135 will be able to comprehend current research and explore quantum algorithms on their own, ready to join this future workforce.",
    "subject": "Science",
    "level": "University",
    "semester": "Year-long",
    "prerequisites": [],
    "slug": "up135"
  }
]