{
  "jlcd1": [
    {
      "id": "r_1760312577744",
      "course_id": "jlcd1",
      "rating": null,
      "author": "asdfasdfa",
      "text": "THIS IS SO DUMB",
      "created_at": "2025-10-12T23:42:57.744Z",
      "status": "published",
      "replies": [],
      "poster_email": "adaelise@ohs.stanford.edu",
      "poster_sid": "7893098287811fc2c4ef4f03611ec0ac"
    },
    {
      "id": "r_1760311755593",
      "course_id": "jlcd1",
      "rating": null,
      "author": null,
      "text": "asdfasdfasdf",
      "created_at": "2025-10-12T23:29:15.593Z",
      "status": "published",
      "replies": [],
      "poster_email": "adaelise@ohs.stanford.edu",
      "poster_sid": "7893098287811fc2c4ef4f03611ec0ac"
    },
    {
      "id": "r_1760311657710",
      "course_id": "jlcd1",
      "rating": null,
      "author": null,
      "text": "ae asdf easdf e",
      "created_at": "2025-10-12T23:27:37.710Z",
      "status": "published",
      "replies": [],
      "poster_email": "adaelise@ohs.stanford.edu",
      "poster_sid": "7893098287811fc2c4ef4f03611ec0ac"
    },
    {
      "id": "r_1760311486312",
      "course_id": "jlcd1",
      "rating": null,
      "author": "asdfasdfasdf",
      "text": "asdfasdf",
      "created_at": "2025-10-12T23:24:46.312Z",
      "status": "published",
      "replies": [],
      "poster_email": "adaelise@ohs.stanford.edu",
      "poster_sid": "7893098287811fc2c4ef4f03611ec0ac"
    },
    {
      "id": "r_1760311477969",
      "course_id": "jlcd1",
      "rating": null,
      "author": null,
      "text": "testest",
      "created_at": "2025-10-12T23:24:37.969Z",
      "status": "published",
      "replies": [],
      "poster_email": "adaelise@ohs.stanford.edu",
      "poster_sid": "7893098287811fc2c4ef4f03611ec0ac"
    },
    {
      "id": "r_1760311241856",
      "course_id": "jlcd1",
      "rating": null,
      "author": "adaelise",
      "text": "asdfasdfasdf",
      "created_at": "2025-10-12T23:20:41.856Z",
      "status": "published",
      "replies": [],
      "poster_email": "adaelise@ohs.stanford.edu",
      "poster_sid": "7893098287811fc2c4ef4f03611ec0ac"
    },
    {
      "id": "r_1760311174679",
      "course_id": "jlcd1",
      "rating": null,
      "author": "adaelise",
      "text": "testets",
      "created_at": "2025-10-12T23:19:34.679Z",
      "status": "published",
      "replies": [],
      "poster_email": "adaelise@ohs.stanford.edu",
      "poster_sid": "7893098287811fc2c4ef4f03611ec0ac"
    },
    {
      "id": "r_1760311048470",
      "course_id": "jlcd1",
      "rating": null,
      "author": "adaelise",
      "text": "testsdfsdf",
      "created_at": "2025-10-12T23:17:28.470Z",
      "status": "published",
      "replies": [],
      "poster_email": "adaelise@ohs.stanford.edu",
      "poster_sid": "7893098287811fc2c4ef4f03611ec0ac"
    },
    {
      "id": "r_1760232595891",
      "course_id": "jlcd1",
      "rating": null,
      "author": null,
      "text": "(Dr. Walker-Dale) (2024-2025) Dr. Walker-Dale is an awesome teacher and is always really funny in class. (Just make sure to take notes. Take notes, and don’t lose them, or you get Lady Voldemorta mode Dr. Walker-Dale, and, uh…….. You don’t want Lady Voldemorta mode Dr. Walker-Dale.) You even get this Powerpoint before midterms (midterm tests are done in class. We don’t have final exams, just a final essay that is still VERY stressful and I recommend you use the WTC for). Also, participate! Please don’t be the silent kid that shows the top of their head in class and stays muted until hit with the missile called COLD CALLING. And please please please don’t be the kid who forgets to do the reading. I suggest taking notes for the reading AND opening the document before class. Dr. Walker-Dale lets you take your time looking through the document to find answers in the not-so-rare case you get cold-called.",
      "created_at": "2025-10-12T01:29:55.891Z",
      "status": "published",
      "replies": [
        {
          "id": "rp_1760233368875",
          "review_id": "r_1760232595891",
          "author": null,
          "text": "^ I know exactly from the tone and writing style who wrote the review above, and I agree with everything that she/he said. Dr. Walker-Dale is a great teacher, very passionate about the material (since she designed the course), and yes, make sure you take notes and do the reading. She does cold-call, but she is  never mean about it. All in all, I loved her, and it was a great course.",
          "created_at": "2025-10-12T01:42:48.875Z"
        }
      ],
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "id": "r_1760231753472",
      "course_id": "jlcd1",
      "rating": null,
      "author": null,
      "text": "Dr. Hicks is goated, I’m not even gonna lie. She’s super helpful in both office hours and in class discussion. She keeps track of participation using “Golden Tickets” which give you priority to speak during class and never cold-calls and is helpful on her comments and also occasionally adjusts her office hours according to everyone’s schedule. Only slight downside is that she takes a while to grade. REGARDLESS GET THIS TEACHER OR DIE",
      "created_at": "2025-10-12T01:15:53.472Z",
      "status": "published",
      "replies": [
        {
          "id": "rp_1760233110849",
          "review_id": "r_1760231753472",
          "author": null,
          "text": "^you’ve clearly never met HWD",
          "created_at": "2025-10-12T01:38:30.849Z"
        }
      ]
    },
    {
      "id": "r_1760231727284",
      "course_id": "jlcd1",
      "rating": null,
      "author": null,
      "text": "(Dr. Hicks) Great teacher, great course. The readings are all super interesting, even though they are confusing sometimes. Workload is not overly much. Assignments are really fun, only downside Dr. Hicks (who is a great teacher, and leads awesome discussions) is a really slow grader.",
      "created_at": "2025-10-12T01:15:27.284Z",
      "status": "published"
    },
    {
      "id": "r_1760231672898",
      "course_id": "jlcd1",
      "rating": 5,
      "author": null,
      "text": "Holy moly this class was amazing! Dr. Walker-Dale is an incredible instructor and leads very engaging discussions. She grades pretty easy but her feed back is to die for… she writes entire pages for you and her feedback can be longer than what you actually wrote. Topics taught are quite unique (quantum theory, modernity, etc.) and you even get to lead class for a day (where you can cold call lol). HWD was helpful in office hours but she likes participation so participating a lot will help. Also readings were super long so I’d recommend that you start early on them. 11/10 and would 100% recommend! :D",
      "created_at": "2025-10-12T01:14:32.898Z",
      "status": "published"
    },
    {
      "id": "r_1760230990094",
      "course_id": "jlcd1",
      "rating": null,
      "author": null,
      "text": "Great class!!!, but tons of preparation",
      "created_at": "2025-10-12T01:03:10.094Z",
      "status": "published"
    }
  ],
  "jhns2": [
    {
      "id": "r_1760233445476",
      "course_id": "jhns2",
      "rating": null,
      "author": null,
      "text": "(Dr. Weil) [2025] Dr. Weil is a nice guy but I do have a bit of a bone to pick. Generally I found his discussions uninteresting and not super engaging, but take that as you may. My biggest pet peeve with Weil is that he’s very unclear with what he wants from you, and gives pretty confusing and un-constructive feedback. Best thing I can recommend if you’re struggling with that is to go to office hours and talk with him and get clear on his expectations. Just try and get through it as best you can. I will say that I found it hard to express opinions or go about work the way it made sense for me. He’s very strict about writing his way, understanding things his way, and doing things his way. The first few months were okay, but near the end of the semester I just felt tired and depleted. If you get him, you’ll work through it, but if you can switch, I would suggest it.",
      "created_at": "2025-10-12T01:44:05.476Z",
      "status": "published",
      "replies": [],
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "id": "r_1760233441892",
      "course_id": "jhns2",
      "rating": null,
      "author": null,
      "text": "(Dr. Neemeh) [2024] Dr. Neemeh was great! They were super chill and good at handling fights and issues in the chat. They’re very respectful, especially if personal issues are interfering with your participation in the class. The discussions are interesting and civil, some of the most fun I’ve had. They’re a bit of a harsh grader but are very good at giving clear and concise feedback to help you grow as a writer. Neemeh is the GOAT, would recommend👍",
      "created_at": "2025-10-12T01:44:01.892Z",
      "status": "published",
      "replies": [],
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "id": "r_1760233436108",
      "course_id": "jhns2",
      "rating": null,
      "author": null,
      "text": "(Dr. Rees) [2025] bro dr rees is def the worst hns teacher. The class basically teaches you to have an open mind, but he has the opposite of an open mind, like he takes off points for not perfectly conforming to his vision of what a philosopher is. It is downright painful to try and make a logical argument during class, since he just bulldozes it down by totally ignoring it and forcing everyone to focus on what some dumb philosopher says. Like the whole point of hns is to learn how to think, but all dr rees teaches is how other philosophers think, there’s not much practice on thinking for yourself. Some parts of the class were inherently dumb, like the phrase “human nature” (humans are so fricking diverse) or the fact that you get points taken off reading questions if you add some of your opinion to it (you just have to word vomit the opinions and badly formed arguments of some philosopher from the reading) and my friend got points taken off for some really dumb reasons, like not fully articulating an obvious idea. From what I can see, the only way to get an A in this class with this teacher is to either 1. Be a really good writer or 2. Read the readings cover to cover and essentially just answer each question in the most boring, obvious way. He also doesn’t read the chat. Which is a problem, obviously. Also don’t use the word “solid” in assignments, he can’t seem to comprehend that it has multiple meanings other than a stage of matter.",
      "created_at": "2025-10-12T01:43:56.108Z",
      "status": "published",
      "replies": [],
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "id": "r_1760233409996",
      "course_id": "jhns2",
      "rating": null,
      "author": null,
      "text": "(Dr. Rees) [2025] Dr. Rees is amazing. He grades easy, he is super nice, and the class is just very fun overall. The best part of HNS is randomly criticizing every single philosopher there is & debating about everything aggressively with classmates. And the readings… uh if you don’t like the readings at first, you will at least definitely have better reading comprehension skills by the end of the class. Note for new students: don’t discuss off-topic stuff in the comments, even if it’s about philosophy too. Dr. Rees normally doesn’t watch the comments section because it’s a whirlwind of aggression and colorful speech bubbles, but you can tell sometimes he’s annoyed by it too lol",
      "created_at": "2025-10-12T01:43:29.996Z",
      "status": "published",
      "replies": [
        {
          "id": "rp_1760233420988",
          "review_id": "r_1760233409996",
          "author": null,
          "text": "^Well idk about that but I also got straight As so… personal opinion i guess. Also, the class is NOT boring. At least for my class. It’s literally the least boring class there is and everything is so chaotic. You’ll survive not being off-topic for a few minutes. Looking at the comments, did we even get the same teacher?",
          "created_at": "2025-10-12T01:43:40.988Z"
        },
        {
          "id": "rp_1760233415948",
          "review_id": "r_1760233409996",
          "author": null,
          "text": "^bruh since when does he grade easy? I got almost straight As, but my buddy who is awesome at philosophy got like awful grades for dumb reasons.",
          "created_at": "2025-10-12T01:43:35.948Z"
        }
      ],
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "id": "r_1760233398627",
      "course_id": "jhns2",
      "rating": null,
      "author": null,
      "text": "(Dr. Rees)[2025] I really like the class, since it has a lot of different views that are fun to argue against. Totally recommended for anyone who loves arguing/debate/logic and will argue against almost every philosopher just because they can. Dr Rees is cool, but he grades kinda harsh, so make sure your writing is perfectly clear and you address every single part of the prompt.",
      "created_at": "2025-10-12T01:43:18.627Z",
      "status": "published",
      "replies": [
        {
          "id": "rp_1760233405141",
          "review_id": "r_1760233398627",
          "author": null,
          "text": "^I agree with everything above, except I wouldn’t recommend Dr. Rees for students who like to think for themselves. It’s incredibly aggravating. Spoken as someone who personally insulted most of the philosophers from the readings for valid reasons. HWD is the best teacher for this class.",
          "created_at": "2025-10-12T01:43:25.141Z"
        }
      ],
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "id": "r_1760233394412",
      "course_id": "jhns2",
      "rating": null,
      "author": null,
      "text": "(Dr. Neemeh) [2024] Pretty nice class! The readings can feel really long, but Dr. Neemeh spends a good amount of time explaining during class. My biggest concern is that we often have really long readings and have to submit reading questions before having class time to properly break down the reading. Honestly not too bad, it can be stressful at times, but as long as you take time to close read you can do pretty well.",
      "created_at": "2025-10-12T01:43:14.412Z",
      "status": "published",
      "replies": [],
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "id": "r_1760233386636",
      "course_id": "jhns2",
      "rating": null,
      "author": null,
      "text": "(Dr. Weil) [2023-2024] Meh class. A lot of him rambling about the material and making us summarize it in the discussion sections so it was kind of underwhelming. He gives a lot of feedback on assignments but 50% of it is “elaborate on this.” He’s pretty helpful in office hours and responds to emails a lot but I usually went to office hours to figure out what he wanted me to write so most of the essays were really based on his conception of a “good paper” rather than an interesting thesis/content. Another really annoying aspect of his course is that he would ask us to participate in class and share our opinions about the reading but when we talked about our opinions he would criticize them so participation really went down at the end of the year. Also the reading questions due before class are super unhelpful since they are worth a decent portion of your grade and they are graded based on correctness. The problem is, they are done before class so there isn’t time to ask for help or let the material sink in. A decent amount of students were kinda stressed about the reading questions since some of the questions were cryptic and the readings were convoluted at times. I feel like the course causes more annoyance than stress but overall you are not missing out if you don’t take it. If you end up taking it I would recommend getting a different teacher to avoid boredom and annoyance. Might have been because I wasn’t really interested in what we were reading but the teacher didn’t help.",
      "created_at": "2025-10-12T01:43:06.636Z",
      "status": "published",
      "replies": [],
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "id": "r_1760233380220",
      "course_id": "jhns2",
      "rating": null,
      "author": null,
      "text": "(Dr. Walker-Dale) [2023-2024] This class was great and really fun! Dr. HWD’s feedback on assignments was always the best and really helpful in the future.  I can tell that she took a careful and long time examining all my papers and definitely helped me understand this course well, because I was very shaky in the beginning.",
      "created_at": "2025-10-12T01:43:00.220Z",
      "status": "published",
      "replies": [],
      "upvotes": 0,
      "downvotes": 0
    }
  ],
  "omsb9": [
    {
      "id": "r_1760308671569",
      "course_id": "omsb9",
      "rating": 2,
      "author": "jules328",
      "text": "test test",
      "created_at": "2025-10-12T22:37:51.569Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233939996",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr.Chance) I think he is very good at actual philosophy classes, and this class is more based on stats. He doesn't really know how to solve your problems if you don't know something( usually it's better to ask AI for help) He gives B+ to A for the big writing assignments. It's very weird how this course curves the midterms and finals, but i think Dr.Chance usually gives A’s for them.",
      "created_at": "2025-10-12T01:52:19.996Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233935572",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr Chance) Dr Chance is a very good teacher in general, the class discussions are kinda useful and there is some other content outside of the lectures, the course isnt rlly good but dr chance is a nice teacher, but his voice makes me want to go to sleep for some reason.",
      "created_at": "2025-10-12T01:52:15.572Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233931443",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr. Wallhagen) [2023-2024] - honestly dr. wallhagen is way overhated while he’s a strict grader, if you make sure to do the readings and go to his office hours, he really cares about making sure you understand the material and do as well as you can. The quizzes were definitely hard and required you to think about the material, but the writing assignments were super fun and so were jeopardy weeks!",
      "created_at": "2025-10-12T01:52:11.443Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233926163",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Mare) Its basically just a stats class with very little bio or philosophy so if you’re into that it probably won’t be too bad. Personally, I was not a fan because it was sold to me as a philosophical bio class and I hated all the stats stuff. Dr. Mare is fine, talks pretty slow and monotone and can get sidetracked but he’s mostly chill. The only time I really didn’t like him was when I forgot to submit something and he absolutely ripped me to shreds in his comment on canvas.",
      "created_at": "2025-10-12T01:52:06.163Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233922424",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Mare) I hated the class, dropped it for the second semester. The content was just really confusing and chaotic for me. The lectures were boring and VERY LONG. Mare isn’t too bad (he let me do finals corrections even after I dropped the course), I just dislike the course and how its setup, especially how topics are introduced.",
      "created_at": "2025-10-12T01:52:02.424Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233919428",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr Neemeh) [2023-2024] I didn’t find the discussions in class super helpful since usually we just went over the same things that we learned in the lectures before class, and didn’t go much deeper than that. This deeper analysis would have been helpful since there were numerous quiz questions that were either on material that wasn’t explicitly taught, or required analysis of what was taught, but then you were never taught how to do that analysis. A lot of the exams and midterms had those sort of questions too, so I’m glad there were corrections. Definitely go to office hours or email if you have any questions since you can avoid getting docked points pretty easily that way.",
      "created_at": "2025-10-12T01:51:59.428Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233916564",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr Wallhagen) [2023-2024] Super awesome teacher. Makes the class interesting and goes really in-depth with the material. You can tell he really enjoys teaching, and he brings that enthusiasm to his lectures. He challenges his students, which will definitely make yo+u a better learner, and he always makes sure to stay on a particular subject until the entire class understands it, not just the most advanced students. Also, he is willing to engage in discussions with students and gets super interested in what they have to say, even if it’s not entirely related to the subject of discussion (for example if you have an insight about the material and want to share it, many times it will turn into a class-wide discussion). In my experience, his grading is extremely lenient on writing assignments, but very strict on the short answer sections of the exams.",
      "created_at": "2025-10-12T01:51:56.564Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233912525",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr. Neemeh) [2023-2024] Super helpful MSB teacher! The course itself was not too bad but the stats were a little confusing as that was totally a new field for me. Dr. Neemeh was a great teacher though and helped me to understand the material. As long as you watch the lectures before class (very important to do!!) then the class will make sense. The course workload wasnt too much but for writing assignments definitely dont wait until last minute in case you need help on answering some of the questions (as Dr. Neemeh doesnt usually answer emails over weekends). He was helpful in office hours and lets you run ideas by him to let you know if you are on the right track. Also not a mean grader! As long as you put in the work and show an understanding of the material, its not hard to get an A (this is for things like the writing assignments). The exams in this class are a little challenging but as long as you understand the material you will be fine. The exams are open note so they wont ask simple definition questions and will require you to be well versed in the subject. But dont let that discourage you!!! Just make sure to always watch the lectures before class and if you are struggling with something then go to office hours. If you do this then you will be just fine. There were, at least this year, corrections for the exams that will give you up to half points back. Dr. Neemeh is a pretty fair and lenient grader on exams. Overall great teacher but MSB was not my favorite course. (Though not hard to finish with a strong A as long as you put in the work :))!",
      "created_at": "2025-10-12T01:51:52.525Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233907380",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr. Tillman) Dr Tillman is nice and his tangents where kinda funny, but honestly they didn’t really help me understand the topic. The lectures are really important because not everything covered in the lectures is covered in class, and the weekly quizzes are on the content covered in the lectures. The quizzes are kinda confusing, as they are more focused on applying what we learned in the lectures, not showing that you watched them. The midterms/finals and essays were weird, and I usually got worse grades than I was expecting tbh.",
      "created_at": "2025-10-12T01:51:47.380Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233903740",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "Tillman is a great teacher but has hneemehigh specific standards, but is fair and a good teacher",
      "created_at": "2025-10-12T01:51:43.740Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233900188",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr Tillman) Definitely the best MSB teacher. Is very engaging and willing to explain material. His classes are honestly really fun and enjoyable, and he is good about having review",
      "created_at": "2025-10-12T01:51:40.188Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233894564",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "I also agree that Neemeh is the best MSB instructor. They made sure the class was engaging and fun, and never made me feel stupid. Neemeh also had a thing with checking up with some students before class started, and idk I thought that was super helpful with making the environment less stressful. If someone had a question they made sure to let us know that OH was always open for us, or we could ask in class. I do not recommend emailing them because they take an eternity to respond, so PLEASE take into consideration the OH or in class questions seriously! But I definitely recommend Dr. Neemeh as a core instructor for those who were wondering :D",
      "created_at": "2025-10-12T01:51:34.564Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233890940",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr Neemeh) [2024-2025] Dr. Neemeh is an AMAZING teacher. They teach clearly, concisely and is super kind, so if you need any help on a quiz, an assignment, or even just to chat, Dr. Neemeh is there for you in office hours! I learnt so much in MSB and was amazed by how they explained things. A tip I have for this course is to write notes during class, as it is super helpful for the weekly quizzes. If you have any questions, ask Dr. Neemeh because you want to make sure that you understand each concept. The class environment is super chill and not stressful at all! Overall, amazing course, amazing teacher.",
      "created_at": "2025-10-12T01:51:30.940Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233887628",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "Dr. Neehmeh was a good teacher and a fair grader, you could easily tell what they wanted if you got points taken off. My only complaint is that they were not always the fastest to answer emails and office hours. Other than that it was a great year.",
      "created_at": "2025-10-12T01:51:27.628Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233884692",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr Neemeh) [2023-2024] Probably the best MSB teacher ngl.",
      "created_at": "2025-10-12T01:51:24.692Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233880100",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr. Wallhagen) [2023-2024] Amazing at helping you understand a topic if you ask the right questions, you can’t expect everything to be spoon-fed to you so if you have questions in his class ASK. He is quite a specific and harsh grader at times which can be difficult to cope with. Also if you are doing an assignment BE AS SPECIFIC AS POSSIBLE. He isn’t really as bad as a teacher that everyone makes him seem to be, but if you are fragile about grades and don’t think you can handle learning from mistakes probably go for another section. (I agree)",
      "created_at": "2025-10-12T01:51:20.100Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233875060",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr Wallhagen) [2023-2024] he’s chill and cool until he grades your stuff, then hes really strict. Also don’t say “damn” or “hell” or eat in class because he will like     call you out for that, but tbh hes overhated and if you care more about understanding the material and having a fun time in class then go ahead.",
      "created_at": "2025-10-12T01:51:15.060Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233870891",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr Wallhagen) [2023-2024] lets just say he will ruin your gpa and roast you on anything you get wrong, tillman is considered best msb teacher",
      "created_at": "2025-10-12T01:51:10.891Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233866220",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr. Wallhagen) [2024-2025] He wasn’t bad, but he wasn’t exactly great either. I would NOT say the environment is very welcoming. I have frozen up when asked questions in his class- something that has never happened in another class. Also cried during jeopardy.",
      "created_at": "2025-10-12T01:51:06.220Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233862363",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "AVOID WALLHAGEN AT ALL COSTS",
      "created_at": "2025-10-12T01:51:02.363Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233858219",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr. Mare) [2023-2024] MSB IS AWESOME!!! Don’t let the fools down below tell you otherwise. Not particularly interesting but it’s not that bad",
      "created_at": "2025-10-12T01:50:58.219Z",
      "status": "published",
      "replies": []
    }
  ],
  "ohsc0": [
    {
      "id": "r_1760300437054",
      "course_id": "ohsc0",
      "rating": 2,
      "author": null,
      "text": "Tillman was not great. had a list of 20 rules to follow for papers (sort of a rubric), but papers were graded very arbitrarily and points were taken off without explanation. I personally found him annoying but ik that a lot of people like him. Sometimes taught class from bed, usually left it up to students to lead the discussion, which was not great for the dense materiel. Generally a pretty boring class, the only part I liked was logic.",
      "created_at": "2025-10-12T20:20:37.054Z",
      "status": "published",
      "replies": [],
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "id": "r_1760298133261",
      "course_id": "ohsc0",
      "rating": null,
      "author": null,
      "text": "(Dr.McLukie) most responsible teacher ever. I know he’s strict, have a list in class to basically force participation, but you have to admit that WORTH IT. Very quick on feedback, clear and effective ones, though a bit strict, especially for logic homework… Occasional humor, philosophical ones that we don’t always get but it brought a nice class atmosphere! ++ totally agree",
      "created_at": "2025-10-12T19:42:13.261Z",
      "status": "published",
      "replies": [],
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "id": "r_1760298128925",
      "course_id": "ohsc0",
      "rating": null,
      "author": null,
      "text": "(Dr. Mare) Course-wise= Interesting class! The laws/events in science that you learned superficially in regular science classes are put in the broader scheme of history (what was happening around this time as well that might’ve affected it) and philosophy (what grounds did they use to accept this theory rather than the other). Science was qualitative, rather than quantitative for a while. But why did it change? How? Those are the kind of questions you ask yourself in this class. A lot of old readings though + will vary widely in length+amount of time needed to read. Logic homework is actually not bad./ Teacher review= Pros: Very chill, nice grader (YAY GPA), will let you get a ton of extensions, and tries to keep up with movies and singers (TSwift fan). Cons: Releases grades and feedback a little late (but all OHS teachers do anyway (in my experience)), not so good in-class time management (sometimes not all 8 people would get to participate).",
      "created_at": "2025-10-12T19:42:08.925Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298113933",
      "course_id": "ohsc0",
      "rating": null,
      "author": null,
      "text": "(Dr. McLuckie) I think I kinda lucked out bc I had quite a fun section and found the readings interesting, so I enjoyed the discussions in class. He also tended to join in on our jokes and banter and such, so he was a pretty fun teacher. However, he does keep a list on the AC with everyone’s names so there can be lots of pressure when it comes to participation, and he’s quite harsh with grading literally everything. From logic hw’s to papers to participation, he’s very nitpicky and strict. You can’t exactly expect participation grades to be easy and free 100s with him, I think I participated with *new* input at least 2-3 times per class in order to get a 100. He also only gives one extension per semester, and you have to let him know really early with some incredible excuse. Overall, fun class and fun teacher, but very very harsh in all aspects.",
      "created_at": "2025-10-12T19:41:53.933Z",
      "status": "published",
      "replies": [
        {
          "id": "rp_1760298121206",
          "review_id": "r_1760298113933",
          "author": null,
          "text": "++ (different person) I totally agree with this course review, Dr. McLuckie was a great HSC teacher and his classes were very engaging, especially because I lucked out with a great section. Only thing I disagree with is the excuse part, if I recall correctly the once-a-semester extension was no questions asked, just let him know beforehand (literally right before it was due in my case), and he’s super understanding",
          "created_at": "2025-10-12T19:42:01.206Z"
        }
      ]
    },
    {
      "id": "r_1760298108685",
      "course_id": "ohsc0",
      "rating": null,
      "author": null,
      "text": "(Dr. Hicks) When I took this class, it was my favorite. I eventually learned that people didn’t love the class… What I truly learned was that Dr. Hicks makes any core class your favorite. Get Dr. Hicks.",
      "created_at": "2025-10-12T19:41:48.685Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298104851",
      "course_id": "ohsc0",
      "rating": null,
      "author": null,
      "text": "Dr. Katchirian was an amazing teacher. Her comments on my work were very helpful, and class discussions were really fun. She was great at explaining the hard/challenging material and her OH were really helpful when it came to essays and such. I would say that her grading was pretty lenient as long as you try your best. (We also had multiple extensions on assignments which was nice.)",
      "created_at": "2025-10-12T19:41:44.851Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298101141",
      "course_id": "ohsc0",
      "rating": null,
      "author": null,
      "text": "Dr. Hicks is super supportive. I highly recommend office hours to build a connection with her",
      "created_at": "2025-10-12T19:41:41.141Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298097372",
      "course_id": "ohsc0",
      "rating": null,
      "author": null,
      "text": "Super interesting course, I just wish there were more women covered, though my teacher mentioned that they are looking to add more women in next year",
      "created_at": "2025-10-12T19:41:37.372Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298093012",
      "course_id": "ohsc0",
      "rating": null,
      "author": null,
      "text": "Dr. Mare is the best!",
      "created_at": "2025-10-12T19:41:33.012Z",
      "status": "published",
      "replies": []
    }
  ],
  "odfrl": [
    {
      "id": "r_1760298268852",
      "course_id": "odfrl",
      "rating": null,
      "author": null,
      "text": "(Dr. Bischof)^^ I second this! I had Dr. Bischof this year and she was easily one of my fav teachers of all time. This was also her first year at OHS so she did an incredible job as a first-timer. Our class size was really small so there was sometimes not a lot of participation but in a larger class I’m sure there would be more. As a teacher, Dr. Bischof is super nice and as said above, extremely lenient with extensions (no limit on extensions, as long as you ask about 24ish hours in advance, she’ll give you one without needing justification). She always gives super detailed feedback on papers, explaining exactly which parts were good and what you could add to make it better for next time. I wouldn’t necessarily say she’s a “lenient” grader but definitely super fair and if you go to her Office Hours your essay grade will literally increase by like 5-10%. Also pro tip: for the expert sessions, assume no one has done the reading and ask questions that are good but can still be answered without reading the text. I feel like that usually generates more participation from the class. And one last thing, make sure to email her the expert session slides 24 hrs in advance. I would’ve gotten 100 on both presentations but got 95 on my 2nd semester one bc I sent it to her the day of.",
      "created_at": "2025-10-12T19:44:28.852Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298264437",
      "course_id": "odfrl",
      "rating": null,
      "author": null,
      "text": "(Dr. Bischof) Awesome teacher. She only taught one section of DFRL and no other OHS courses, but she was fantastic. Very fast grader, and is pretty lenient. We had a small class size, and always managed to get through most of the slides. Participation is pretty easy to fulfill-but it might be best to talk more than once in every class imo. Her feedback is really detailed, and she allows unlimited extensions w/out needing a justification, provided you (obviously) ask ~24 hours in advance. The readings were pretty standard for a core class (some were really complex, others were more simple) and it’s pretty easy to participate even if you didn’t understand/forgot the material. . You’re required to do an expert session, but it’s really easy to get an A on it. It should be decently easy to get an A in this class.",
      "created_at": "2025-10-12T19:44:24.437Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298260653",
      "course_id": "odfrl",
      "rating": null,
      "author": null,
      "text": "(Dr. Rees)  I really liked him. He can be kind of dry but it was never an issue. He’s just pretty nonchalant, but I think he’s nicer than he seemed at first. He gave me a long automatic extension on one of the papers which was really nice of him. I think he was a pretty nice grader, and as long as you go to office hours your grade will probably be fine. He presented the material in an understandable way and if I didn’t understand it he would answer my questions well in office hours. The discussions were definitely very student-led (basically he just asks a broad question and people talk about it) and the discussions can get really repetitive (people just repeating someone else’s point to get participation) and off-topic, and Dr. Rees doesn’t really moderate the discussion. So sometimes the actual class discussion felt kind of pointless; I didn’t mind but I know some people do.",
      "created_at": "2025-10-12T19:44:20.653Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298249844",
      "course_id": "odfrl",
      "rating": null,
      "author": null,
      "text": "(Dr. Rees) Incredible teacher. Classes are fun and engaging, Dr. Rees really nice and facilitates discussion well. One of my favorite core teachers for sure. Grading isn’t bad at all, I’d only wish that he’d give more detailed feedback but there’s a decent amount of homework assignments for buffer. Also, many of the sessions are student-led, which is usually fine but occasionally they didn’t do a great job of explaining the material, so asking for extra clarification in office hours is highly recommended.",
      "created_at": "2025-10-12T19:44:09.844Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298244893",
      "course_id": "odfrl",
      "rating": null,
      "author": null,
      "text": "(Dr. Drogalis) Dr. Drogalis is amazing! Truly awesome teacher! She’s super nice and supportive in class, office hours, and even emails! Her classes are very organized and structured with thought provoking slides that lead to super interesting discussions! Her office hours are super helpful if you’re confused on concepts or even (if there aren’t any other students who need help on coursework there) to chat about anything! She not only cares that you're learning but cares about you as a person. She is definitely one of the best teachers I’ve ever had! Highly recommend!",
      "created_at": "2025-10-12T19:44:04.893Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298240236",
      "course_id": "odfrl",
      "rating": null,
      "author": null,
      "text": "(Dr. Drogalis) This was an absolutely wonderful class in every aspect! Dr. Drogalis is such a great teacher and also just an amazing person. She is one of the kindest teachers you’ll ever meet, extremely understanding, and super helpful. Discussions are structured very effectively. They’re both engaging and good at helping understand the different readings. The class environment is really welcoming, so participation is not difficult at all. Grading is completely fair and nothing to really worry about. If you put in the effort, you’ll do very well. Dr. Drogalis allows extensions on all assignments so long as they’re requested at least 24 hours beforehand, and that’s been helpful to me a few times over the year. Papers are difficult enough to be a challenge without ever seeming overwhelming or impossible. Dr. Drogalis is also very willing to talk through things and give you feedback about paper ideas in Office Hours, so I’d highly recommend going to those. Overall, I really cannot say enough good things about Dr. Drogalis and her class. I’d highly recommend taking DFRL with her!",
      "created_at": "2025-10-12T19:44:00.236Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298235693",
      "course_id": "odfrl",
      "rating": null,
      "author": null,
      "text": "(Dr. Drogalis) She is a super nice, chill, and helpful teacher who is always willing to explain stuff in class or in office hours. Her grading seems fairly normal, and you should be able to get a decent grade if you put in the work. Also, if you’re interested in knowing about the class, it’s actually a pretty nice workload. There are around 3 major papers per year plus a couple minor passage assignments (basically completion-based) and of course one expert session per semester. The readings can get kind of dense, but I recommend watching all the lectures (even the optional ones) so that you can better understand the material.",
      "created_at": "2025-10-12T19:43:55.693Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298223909",
      "course_id": "odfrl",
      "rating": null,
      "author": null,
      "text": "(Dr. McLuckie) He was… very average as a teacher. He definitely doesn’t give out easy A’s for essays but also I feel like he just never gives grades for essays above a 95 (I think most of the core teachers are strict graders though). However, if you pay attention during class, do the readings, etc. you should get an A in the course. I do think the participation rule he enforced made no sense and negatively affected the quality of class discussions because people would literally contribute nothing substantially important! It was frustrating! He’s also not really helpful during office hours (and trust me I to went to them multiple times). Also I know people have said he’s strict about extensions/deadlines but I submitted an assignment late once and he didn’t take off points lol. He is really nice and chill and I think he’s great as a person! As a teacher, though, you might be better off getting someone else.",
      "created_at": "2025-10-12T19:43:43.909Z",
      "status": "published",
      "replies": [
        {
          "id": "rp_1760298230557",
          "review_id": "r_1760298223909",
          "author": null,
          "text": "Ok update I actually think he’s decent as a teacher (personally preferred his way of teaching over many of the other core teachers). Would recommend him or Rees or Drogalis.",
          "created_at": "2025-10-12T19:43:50.557Z"
        }
      ]
    },
    {
      "id": "r_1760298217549",
      "course_id": "odfrl",
      "rating": null,
      "author": null,
      "text": "Also content wise DFRL is chill IF YOU DO THE READINGS. Also at the end of S2 during the law unit Beals would give us lectures instead of readings, which was helpful. Most of the readings aren’t too hefty but they do tend to pile up if you get behind.",
      "created_at": "2025-10-12T19:43:37.549Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298212741",
      "course_id": "odfrl",
      "rating": null,
      "author": null,
      "text": "(24-25) I liked dr beals but did anyone else find that he grades the minor assignments really weirdly? Like he took off points on the prewriting assignment for the final project (the “triple A”) because he didn’t really agree with my connection to the relevant author…? Other than that though, great guy, really knowledgeable teaacher and I had a fun, talkative section so I looked forward to this class!",
      "created_at": "2025-10-12T19:43:32.741Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298208765",
      "course_id": "odfrl",
      "rating": null,
      "author": null,
      "text": "I LOVE dr beals he is AWESOME",
      "created_at": "2025-10-12T19:43:28.765Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298170061",
      "course_id": "odfrl",
      "rating": null,
      "author": null,
      "text": "​​​​(Dr. Beals) I really love Dr. Beals! I found the class fun, and he doesn’t have slides—just a whiteboard, and the discussion sort of goes where it goes. In general, he’s just very knowledgeable about the topics. If I were to say anything, I think it’s sometimes hard to know exactly what to change/improve on in terms of the essays (don’t expect him to comment on what worked well). I’d recommend getting started on the essays early, and going to Office Hours to ask him about specific portions of it—but it also just depends on how much time you have, I wasn’t always able to do that.",
      "created_at": "2025-10-12T19:42:50.061Z",
      "status": "published",
      "replies": [
        {
          "id": "rp_1760298186692",
          "review_id": "r_1760298170061",
          "author": null,
          "text": "(Dr. Beals) ^I second everything in the comment immediately above.",
          "created_at": "2025-10-12T19:43:06.692Z"
        },
        {
          "id": "rp_1760298181477",
          "review_id": "r_1760298170061",
          "author": null,
          "text": "(Dr. Beals) I second everything in the comment 2 above! Class was super fun and I really enjoyed the discussion format. I especially loved the theory of law section at the very end of S2 (probably my favourite section all year), which was something he was trying this year. The lack of positive feedback on essays is sometimes a little confusing, and my essay grades typically fell in the 90-93 range when I started in advance (and usually went to office hours). In general, this class was fun, chill, and interesting.",
          "created_at": "2025-10-12T19:43:01.477Z"
        }
      ]
    },
    {
      "id": "r_1760298166276",
      "course_id": "odfrl",
      "rating": null,
      "author": null,
      "text": "(Dr. Beals) Interesting instructor. Definitely quite silly, but not in a bad way. His grading sometimes doesn’t make much sense on the smaller assignments - not sure this matters. The instructor seems passionate about the topics he is teaching, which is a great positive. Generally Dr. Beals is just a chill dude who’s mostly competent, probably the best option out of the teachers",
      "created_at": "2025-10-12T19:42:46.276Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298161909",
      "course_id": "odfrl",
      "rating": null,
      "author": null,
      "text": "(Dr. McLuckie) I also did not like Dr. McLuckie that much. He had this weird rule where you couldn’t pause your camera for more than 5 minutes per class, which I never understood. There’s a participation list where he removes the names of those who spoke so everyone feels forced to speak before the class ends (discussions become quite repetitive). If you attend office hours, he doesn’t give that much feedback; if you ask him questions, the responses are very vague (for instance, if you ask him if it’s alright to go a few lines over the page limit, he’ll talk about how magazine publications require strict page limits, so what exactly am I supposed to do with that information). Papers are also graded very strictly, you receive a grade but do not know where your points were deducted because there is no rubric.",
      "created_at": "2025-10-12T19:42:41.909Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298158189",
      "course_id": "odfrl",
      "rating": null,
      "author": null,
      "text": "(Dr. McLuckie) I didn’t really like him – he was kinda silly but wasn’t that helpful. He forces everyone in the class to participate every session which makes a lot of the participation not feel genuine and be repetitive. Really really not lenient with extensions even though I had valid reasons. In office hours gave kinda cryptic responses that often took 3 repetitions of the question in different words to get anything out of. Graded passages really weirdly harshly first sem but second sem made more sense.",
      "created_at": "2025-10-12T19:42:38.189Z",
      "status": "published",
      "replies": []
    }
  ],
  "ocra1": [
    {
      "id": "r_1760298303452",
      "course_id": "ocra1",
      "rating": null,
      "author": null,
      "text": "(Dr. Rees) 23-24 Favorite class and best teacher I have ever had tbh. I got lucky with a small and very fun section (<3), but I think even without that Dr. Rees would run class discussions really well. He generally uses slides with good discussion questions, and gives everyone space to talk while still saying something interesting/useful about everyone's point. You can tell he's really passionate and knowledgeable about philosophy which is nice. He's also really genuinely helpful during office hours. Every time I went with a question / difficulty he was very clear and efficient in saying something like \"so it sounds like this is your problem, here's another way to think about it / some advice / etc.\" I also got into some interesting philosophy discussions with him in office hours. 10/10 amazing class amazing teacher",
      "created_at": "2025-10-12T19:45:03.452Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298299724",
      "course_id": "ocra1",
      "rating": null,
      "author": null,
      "text": "(Dr. Beals) [2024-25] He’s very nice and talks a lot but he isn’t the easiest grader (try Hicks or even Rees). As mentioned above, he has a super free class structure where he just uses a whiteboard and writes random stuff on it depending on what we are discussing. Also, even if you participate on mic every class, he doesn’t give 100. There are also these virtue assignments which are easy 10s but are not very helpful (I’d rather just have those be reading question assignments like other instructors or normal courses). The best part is we got to watch movies/TV show episodes for the last unit.",
      "created_at": "2025-10-12T19:44:59.724Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298296125",
      "course_id": "ocra1",
      "rating": null,
      "author": null,
      "text": "(Dr. Beals) Absolutely wonderful class! If you are familiar with Beals from DFRL etc then this is more of the same. However, because the CRA readings are denser and the activity for the day is more aligned with “how can we figure this out”, his style of going on longer rants and keeping to a freer class structure works pretty well here. I would suggest his section if you enjoy speaking on mic and want a really easy teacher to have discussions with both in class and in office hours. Grading is pretty fair too.",
      "created_at": "2025-10-12T19:44:56.125Z",
      "status": "published",
      "replies": []
    }
  ],
  "ophi25": [
    {
      "id": "r_1760298325949",
      "course_id": "ophi25",
      "rating": null,
      "author": null,
      "text": "(Dr. Wallhagen) Wally, Wallslaygen, etc. is probably one of the more controversial OHS instructors. However, this class was him at his best. The flexibility of the course material and his ability to basically teach whatever he wanted meant that you were getting a very fun class experience with someone who is so clearly passionate about what they are talking about. Since we don’t know if this class is on offer again, I would suggest his SOTM section or this class if he ever teaches it again due to the flexibility of the material.",
      "created_at": "2025-10-12T19:45:25.949Z",
      "status": "published",
      "replies": []
    }
  ],
  "ophi28": [
    {
      "id": "r_1760298332781",
      "course_id": "ophi28",
      "rating": null,
      "author": null,
      "text": "(Dr. Weil) Dr. Weil is a generally fair grader, kind teacher, and overall fine instructor. It did not help him that his topic was one of the worst ideas for a class I have ever seen. The complete lack of material basis for anything that we discussed, along with the inclusion of nearly zero traditional philosophy concepts made this class simply a festering pit of yapping. Every single day we had class some general questions would be asked, either from Weil or from a presentation, and then a long line of people who really wanted participation would just make something up, due to the topic being AI which no one actually understands and doesn’t exist today in the ways that it was being discussed. Slightly card-board cutout-core teacher, but if he was teaching a more normal class I could see him being rather enjoyable.",
      "created_at": "2025-10-12T19:45:32.781Z",
      "status": "published",
      "replies": []
    }
  ],
  "je01x": [
    {
      "id": "r_1760298352260",
      "course_id": "je01x",
      "rating": null,
      "author": null,
      "text": "Dr. Hruska is the BEST ENGLISH TEACHER EVER I SWEAR! She is so kind and funny, creates class characters, and we read amazing books!",
      "created_at": "2025-10-12T19:45:52.260Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298347749",
      "course_id": "je01x",
      "rating": null,
      "author": null,
      "text": "Yes, Dr. Hruska is the best teacher ever. She is so nice and fun, but also gives amazing feedback and has great class discussions. The course is also amazing, we read some great books, and the assignments for them were super fun. Not actually much work, and just an amazing course with an amazing teacher.",
      "created_at": "2025-10-12T19:45:47.749Z",
      "status": "published",
      "replies": []
    }
  ],
  "je001": [
    {
      "id": "r_1760298414252",
      "course_id": "je001",
      "rating": null,
      "author": null,
      "text": "PLEASE PLEASE PLEASE AVOID MRS. STANFORD AT ALL COSTS. I understand she is a favorite of some because she is passionate and knowledgeable guys she has made people suicidal and I genuinely understand why. Like holy moly I would literally leave her office hours crying. She is incredibly strict and has very very rigid rules but does not make any effort to explain them and so unless you have experience with college level English which I guarantee you most seventh graders do not, you will be constantly yelled at and punished and penalized for not following rules she didn’t even bother to tell you. She really loves participation and I did not understand OHS during my first semester so I didn’t understand how big of a deal participation was and I was too shy anyways. I tried to explain in office hours why I didn’t participate because I was too scared and would stutter a lot and she literally told me if I had a stutter I should go get medical help for it. PLEASE do not take this course with Stanford, if you can please avoid it. If you are not one of her favorites you are genuinely so cooked and she makes no exceptions whatsoever. Take JE01X and then go to TLA. I switched to JE01X after one semester of JE001 because I literally could not take it anymore.",
      "created_at": "2025-10-12T19:46:54.252Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298403572",
      "course_id": "je001",
      "rating": null,
      "author": null,
      "text": "(JE001) [2024-2025] - Mrs. Stanford, 1st semester, Ms. Haas and Mr. Hrusovsky in 2nd - Mrs. Stanford is a decent teacher overall, but it’s too bad she didn’t teach in 2nd semester. She is good when it comes to teaching, but she is very strict and cold calls pretty frequently. Like the rest of the reviews, yes, she does play strict, and yes, she really cares about participation, and yes, she has really high standards on grading, but she wants to make sure you learn and improve and that’s the reason she’s like that. She was out for the second semester because she’s ill and she still isn’t back yet, so I really hope she gets well soon. Ms. Haas, however, wasn't really that good of a teacher. Yeah, she kinda cares about her students, but she isn’t really that helpful most of the time. Maybe I’m wrong because I only spent 2.5 months with her as my teacher, but eh. Mr. Hrusovsky, on the other hand, is a pretty good teacher. He’s helpful in office hours, nice overall, gives detailed feedback on assignments, and he was a lot better than Ms. haas tbh, no offense",
      "created_at": "2025-10-12T19:46:43.572Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298396469",
      "course_id": "je001",
      "rating": null,
      "author": null,
      "text": "(Mrs. Stanford) I mean…this class taught me a lot and Mrs. Stanford could be nice sometimes. She definitely plays favorites so make a good impression in the first few weeks. She also cold calls, so definitely pay attention in class or talk at the beginning bc she usually never cold calls you if you’ve spoken once or twice. Also, she basically reads everything in class with everyone (we each were one character when reading Hamlet for example, best part of the class), so just skim the readings. But read them for the first few weeks because she doesn’t always do that in the fall semester. She’s a harsh grader, on the homework assignments I usually got 8.5/10, maybe 9/10 on a good week and 7/10 on a bad. She gave a lot of good feedback on all the homework and the bigger assignments. On the bigger papers I got a few B+ and some B’s. I probably spent about 4-5 hrs a week (not including class time) on this class at the beginning (like when I did all the readings and stuff) but once I figured out how much she reviews the text in class I was only spending like 3-4hrs. I had a really bad experience in office hours personally (I couldn’t hear her, she couldn’t hear me, I came very late (time zone problems) and she had accidently left the AC room open, anyway big mess) and I never went again but I think I should have bc it would have been really useful for me I think, so don’t make the same mistake as me and go to office hours at the right time! I feel like this class, or more specifically Mrs. Stanford, gets a bad reputation sometimes but honestly isn’t that bad. Definitely not my favorite class ever but I learned a lot and it introduced me to OHS classes well!",
      "created_at": "2025-10-12T19:46:36.469Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298389236",
      "course_id": "je001",
      "rating": null,
      "author": null,
      "text": "(Mrs. Stanford) JE001 was the first American English course I’d ever taken, and I personally found it (and Mrs. Stanford) not as bad as everyone says it was. Coming from a Chinese school, Mrs. Stanford was pretty approachable in comparison (she didn’t take off points for a late submission early in the school year and her classes were fun! She does cold call in class, but pay attention and you’ll be fine. She was very understanding towards my frequent internet difficulties as well)😂. My English writing skills dramatically improved at the end of the school year (some in the Chinese OHS circle say that JE001 makes you good enough for college, and I think there is some truth to that), so I’d say it's a win. Overall just prepare for some low scores in the beginning and don’t panic when you do, note down what went wrong and try again next time. Middle school English is definitely going to be different from elementary school so don’t take it personally. Other than that, visit the writing center often and make it a habit, especially for those of you (like me) who have a hard time getting to office hours due to time zones and b&m school. (I attended office hours once throughout the entire school year at her request. She pointed out my problems very directly so be prepared, just remember that what doesn’t break you makes you stronger emotionally) TLDR: Grading is harsh but gets better when you get used to the system. The writing center is your new best friend.",
      "created_at": "2025-10-12T19:46:29.236Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298381021",
      "course_id": "je001",
      "rating": null,
      "author": null,
      "text": "Don’t do it. Seriously, it’s not a good idea. Mrs. Stanford is very passionate about the material she teaches, but she’s often very focused on her own ideas and snaps at anyone who has different thoughts. She makes a big point about textual evidence in class even when discussing the wider ideas and meaning behind Shakesphere’s writing, even when we’re diving into the realm of “well maybe shakespeare meant this” she’ll only agree with the ideas without textual evidence IF she likes them. My second point ( this is going to be a better essay than I’ve ever written in class for some reason /(h)j ) is her tech issues. Not her own tech issues, mind you. Tech issues should never be something to be angry at someone, and Mrs. Stanford has a lot of them, which is not the problem. The problem is that Mrs. Stanford literally attacks kids who have internet issues, giving them lower participation grades and just treating them unfairly, when she herself spends a good twenty minutes out of some classes out of the room. Now, to quote her many times, “Please fix this before you come to class with tech support” (Stanford, 167). I’m sorry but a lot of people don’t have fast internet and they can’t fix it, and even if they could you can’t predict tech issues before they happen. Next on my long list of issues with this class is the grading. Not only is she crazy biased in her grading, but it takes so long. I understand that she’s busy and she has other matters to attend to, but it's seriously hard to have a single day to correct my draft and address all her feedback. Once I had to literally rewrite a paper because of how much she wanted me to change. I understand that my paper needs correcting, but I can’t do my best work in a day. Either push the date back or give feedback earlier so we can go to the writing and tutoring center.",
      "created_at": "2025-10-12T19:46:21.021Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298374949",
      "course_id": "je001",
      "rating": null,
      "author": null,
      "text": "Well… i had mrs. stanford and all in all she and the course was really good. mrs. stanford is a good introduction to ohs english but do note her grading is very very harsh and she has incredibly high expectations. she also plays favorites and is not afraid to call you out in class. She also stresses participation a lot so i would recommend you participate A LOT in the beginning of the year to make a good impression. However, her feedback is incredibly detailed and she genuinely wants you to improve. Also second semester Hamlet was amazing so definitely recommend",
      "created_at": "2025-10-12T19:46:14.949Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298369749",
      "course_id": "je001",
      "rating": null,
      "author": null,
      "text": "(Dr. Horton) 2024-2025 I had Dr. Horton for the second semester and he was a really funny teacher who enjoys name-changing and using AI images (please don’t get the wrong idea. We all had fun pointing out the extra appendages his AI Hamlets and Laerteses had). He is also a WTC teacher so I recommend going to his section if possible so he can tell you what he wants and what you should do to fulfill that.",
      "created_at": "2025-10-12T19:46:09.749Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760298360373",
      "course_id": "je001",
      "rating": null,
      "author": null,
      "text": "(Dr. Stanford) 2024-2025 I had Dr. Stanford for the first semester and she was an awesome teacher - pleasssseeeeeee take the advice below with a pinch of salt. I get how Dr. Stanford has a harsh reputation (it was like this last year, and I was really REALLY nervous because of it) but she is an awesome teacher once you figure out that you need to talk in class and by the way please take notes in class, or at least screenshot her Housekeeping pages. I recommend going to the WTC for her essays - even logs - and reading the essay instructions carefully. I might be biased because I was the, uh, overactive kid in class, but Dr. Stanford isn’t as bad as some people say.",
      "created_at": "2025-10-12T19:46:00.373Z",
      "status": "published",
      "replies": []
    }
  ],
  "je002": [
    {
      "id": "r_1760300854372",
      "course_id": "je002",
      "rating": null,
      "author": null,
      "text": "(Dr. Morphew) It is really difficult to get good grades, especially with the Writing Assessments. I usually get Cs and Bs for individual assessments, and I’m a straight A student in literacy before. Other than that it’s fine, because I also have Creative Writing with Dr. Morphew and I know he’s chill. The readings are interesting though. Overall, 7.5/10, and it’s really helpful to know that different English teachers have drastically different opinions on how to write an essay. If you went to JE001 with Mrs. Stanford before, try not to bring every detail of advice from the class into this class. Also, Animal Farm rocks",
      "created_at": "2025-10-12T20:27:34.372Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760300850173",
      "course_id": "je002",
      "rating": null,
      "author": null,
      "text": "(Dr. Morphew) He’s a very lenient grader for small assignments (I almost always got 10/10s on them), but he does not give much feedback on them. I don’t think he set up a good “atmosphere”(?) in class, so everyone was very reluctant to participate (most of the time, around half of the class didn’t participate). He grades harsher for writing assessments and gives more feedback on them compared to the small weekly assignments. He’s very chill(?) (I don’t know what the exact word I wanna use is, sorry) in class. He kind of discouraged me from participating (I will not get into the details because they are VERY petty (my details, I mean)), but everyone else seemed to have an alr experience.",
      "created_at": "2025-10-12T20:27:30.173Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760300846413",
      "course_id": "je002",
      "rating": null,
      "author": null,
      "text": "Hendrickson is rly good",
      "created_at": "2025-10-12T20:27:26.413Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760300839014",
      "course_id": "je002",
      "rating": null,
      "author": null,
      "text": "(Dr. KLAH) Dr. KLAH is a W. I loved her class. This is a wonderful course if you want to improve upon your writing skills and understanding of complex classic texts. Discussion sections are always lively and often take us to very interesting places. Dr. KLAH’s affinity for the little details (multiple definitions of words, rhyme scheme, etc.) make for some hilarious and productive conversations. (You can tell Dr. KLAH really loves literature because of the way she approaches the readings). The prompts she uses at the start of class are always unique and help me understand the text better. She encourages many different interpretations, especially in the weekly writing practices. In my opinion, the writing practices are super helpful to build up the skills (textual analysis, how to write a paragraph, how to make a good claim, etc.) that will be expected on the WAs. It's relatively easy to get good grades on the homework, as long as you try to come up with something insightful/interesting to write about. She’s definitely a tougher grader on WAs (I consistently got high 80s), but offers a lot of quality feedback. However, getting a good participation score is easy as long as you contribute on mic once or twice per class and volunteer to read slides. As far as grading speed goes, she is definitely slow (in my experience, it takes about 2 weeks to get homework back and about 3-4 weeks to get a WA back), but the comments are worth it. Every one of her suggestions is specific and relevant. In my opinion, Dr. KLAH is really awesome about offering support outside of class. She always lets us know when the WTC is hosting a helpful event, encourages us to attend office hours, and answers emails super fast. I would definitely recommend using the course lab/office hours for big assignments (like the WAs), it helps a lot. Overall this class is a blast and Dr. KLAH is a wonderful teacher. 10/10, would recommend to all literature nerd middle schoolers.",
      "created_at": "2025-10-12T20:27:19.014Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760300816557",
      "course_id": "je002",
      "rating": null,
      "author": null,
      "text": "(Dr. Hendrickson) I really enjoyed this class! Dr. Hendrickson made it engaging and as mentioned above the discussions were really fun. Always gave 10/10 on weekly homeworks, (didn’t give any feedback on the weekly homeworks at all though) as long as you did the minimum required work, basically just writing a paragraph that answers the prompt. I personally got an average of 89 on the bigger papers (he gave good feedback on these). Each week you have to do two readings (one for each class), usually ~5 pages, not that long, and one (or at the end of the spring semester) two paragraphs for a homework assignment. I spent about 3-4 hrs total in the week (on a week without a big paper due) in this class so it was very manageable (in my opinion). Dr. Hendrickson always had time for “Burning Questions” so make sure to note down all your questions. Favorite part of class was probably the literary warm-ups and maybe the 30sec stretch breaks. Overall, a great class, highly recommended!",
      "created_at": "2025-10-12T20:26:56.557Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760300813718",
      "course_id": "je002",
      "rating": null,
      "author": null,
      "text": "(Dr. Hendrickson) Decent class and fun readings. The discussions were really fun and a big plus is that the weekly homeworks are graded based on effort not content so there’s a lot of free 10/10’s. For major papers, the instructor was kind of vague about expectations but otherwise it was a fun class. 100% recommend.",
      "created_at": "2025-10-12T20:26:53.718Z",
      "status": "published",
      "replies": []
    }
  ],
  "jecw1a": [
    {
      "id": "r_1760300883309",
      "course_id": "jecw1a",
      "rating": null,
      "author": null,
      "text": "I had Dr. Grey for this class. I don’t know if she still teaches here but this course nearly made me quit writing. By the end of the year I thought I “hated writing”, and “only liked telling stories but not writing”. I’m currently working with a friend to write a book. Don’t have her as a teacher for this.",
      "created_at": "2025-10-12T20:28:03.309Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760300879604",
      "course_id": "jecw1a",
      "rating": null,
      "author": null,
      "text": "(Dr. Morphew) Hi I’m the same person who asked about this course a year ago lol. This class is absolutely amazing! If you enjoy creative writing, it will be very fun and definitely helpful to your writing. I’m not sure if this class is still here next year (my course catalog sometimes doesn’t show it) or if it has the same syllabus, but for this year the units were pretty interesting. And the workshop is super helpful, you get your writing revised by your classmates & it’s always fun. It’s extremely easy to get more than 96% in this class. Dr. Morphew is very chill and gives great advice. Note: this course is time-consuming; the workshop comments could go over 1200 words if you want to include everything & it always takes a long time to write the prompts, but it’s worth it lol",
      "created_at": "2025-10-12T20:27:59.604Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760300873574",
      "course_id": "jecw1a",
      "rating": null,
      "author": null,
      "text": "(Dr. Morphew) LITERALLY BEST TEACHER EVER. 🔥 he’s so girlypop. Easy grader, fun assignments. Lots of opportunities to share your work and talk about it if you want to. He’s serious about the participation grades, but it’s all good if you’re a yapper. Also not very much homework, very reasonable (like 3 - 7 hours a week depending on how much you care abt your writing). He doesn’t give much feedback on assignments (on canvas and in class) but you’ll get plenty of helpful feedback from other students! Even though he doesn’t give much feedback on assignments, this class is a great place to work on your writing skills and get practice with innovative prompts. You get lots of creative freedom in this class to do what you want with the prompts. :) I’ve definitely become a much better writer since taking this class (ik that isn’t evident in this post but trust trust) anyways get dr morphew!! Just a chill guy fr. I did class from a pillow fort and he was fine w it.💅 also he’s fine with people chatting w each other in the chat during class (to an extent, ofc) GET DR MORPHEW!! Psa: he shaved his beard womp womp😔",
      "created_at": "2025-10-12T20:27:53.574Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760300866765",
      "course_id": "jecw1a",
      "rating": null,
      "author": null,
      "text": "Dr. Morphew. Honestly, not my favorite teacher. Easy 100s on the homeworks but I somehow have an 80 for participation which is crazy when you compare it to my other participation scores. I genuinely do not understand what he wants from me in my writing and he always bolts as soon as class is over so you can’t even talk to him. I still learned a lot though, definitely a stronger writer because of this class.",
      "created_at": "2025-10-12T20:27:46.765Z",
      "status": "published",
      "replies": []
    }
  ],
  "oe009": [
    {
      "id": "r_1760300936621",
      "course_id": "oe009",
      "rating": null,
      "author": null,
      "text": "Dr. Clinton: Amazing, chill, and interesting material. I actually liked some of the reading in this class despite it not usually being my jam. Funny jokes. One big indicator if the teacher is chill or not is if the students make a google doc or slide of all the silly things they or students said (which we did in this class)",
      "created_at": "2025-10-12T20:28:56.621Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760300932613",
      "course_id": "oe009",
      "rating": null,
      "author": null,
      "text": "Dr. Clinton: Literally the best teacher ever i give him all the glaze i can possibly give. Great feedback, very fast w emails, and most importantly the classes were so comfortable to be in.",
      "created_at": "2025-10-12T20:28:52.613Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760300929612",
      "course_id": "oe009",
      "rating": null,
      "author": null,
      "text": "Dr. Clinton: He makes a fun and welcoming environment, gives free grades for all homeworks, is very chill and helpful, and discussions are always fun.",
      "created_at": "2025-10-12T20:28:49.612Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760300917613",
      "course_id": "oe009",
      "rating": null,
      "author": null,
      "text": "(Dr.Clinton) He makes these weird old jokes that no one laughs at. He is pretty chill about extensions. He gives free grades for the homework, but the big assignments(TA) are around B+ A- .",
      "created_at": "2025-10-12T20:28:37.613Z",
      "status": "published",
      "replies": [
        {
          "id": "rp_1760300925006",
          "review_id": "r_1760300917613",
          "author": null,
          "text": "^Apparently I’m no-one then. I laughed. During the final class my parents were concerned because I was laughing so loud.",
          "created_at": "2025-10-12T20:28:45.006Z"
        }
      ]
    },
    {
      "id": "r_1760300913110",
      "course_id": "oe009",
      "rating": null,
      "author": null,
      "text": "(Dr. Morphew) is a great teacher. He doesn’t yap, he goes into deep thought of the material. Paying attention to how he thinks about and analyzes the text is crucial, and if you are able to do the same then you will get a good grade in his class. Go to office hours for each essay beforehand and afterward, and utilize the WTC, then it’s highly possible to get an A in his class.",
      "created_at": "2025-10-12T20:28:33.110Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760300889878",
      "course_id": "oe009",
      "rating": null,
      "author": null,
      "text": "(Dr Morphew) Don’t get him if there’s someone else available for 24-25, he just yaps and doesn’t really give students a chance to talk in class. Tells me my homework is too short even though it meets the minimum page requirement (about 1 page = 80-90% of the page filled -> “too short” -> 9/10).",
      "created_at": "2025-10-12T20:28:09.878Z",
      "status": "published",
      "replies": [
        {
          "id": "rp_1760300904910",
          "review_id": "r_1760300889878",
          "author": null,
          "text": "^^^^^ PLSSS don’t get Morphew. His grading is pretty harsh….",
          "created_at": "2025-10-12T20:28:24.910Z"
        },
        {
          "id": "rp_1760300896854",
          "review_id": "r_1760300889878",
          "author": null,
          "text": "^^^ class is just him talking most of the time. he also takes like 2 minutes to grade assignments",
          "created_at": "2025-10-12T20:28:16.854Z"
        }
      ]
    }
  ]
}