{
  "jlcd1": [
    {
      "id": "r_1760232595891",
      "course_id": "jlcd1",
      "rating": null,
      "author": null,
      "text": "(Dr. Walker-Dale) (2024-2025) Dr. Walker-Dale is an awesome teacher and is always really funny in class. (Just make sure to take notes. Take notes, and don’t lose them, or you get Lady Voldemorta mode Dr. Walker-Dale, and, uh…….. You don’t want Lady Voldemorta mode Dr. Walker-Dale.) You even get this Powerpoint before midterms (midterm tests are done in class. We don’t have final exams, just a final essay that is still VERY stressful and I recommend you use the WTC for). Also, participate! Please don’t be the silent kid that shows the top of their head in class and stays muted until hit with the missile called COLD CALLING. And please please please don’t be the kid who forgets to do the reading. I suggest taking notes for the reading AND opening the document before class. Dr. Walker-Dale lets you take your time looking through the document to find answers in the not-so-rare case you get cold-called.",
      "created_at": "2025-10-12T01:29:55.891Z",
      "status": "published",
      "replies": [
        {
          "id": "rp_1760233368875",
          "review_id": "r_1760232595891",
          "author": null,
          "text": "^ I know exactly from the tone and writing style who wrote the review above, and I agree with everything that she/he said. Dr. Walker-Dale is a great teacher, very passionate about the material (since she designed the course), and yes, make sure you take notes and do the reading. She does cold-call, but she is  never mean about it. All in all, I loved her, and it was a great course.",
          "created_at": "2025-10-12T01:42:48.875Z"
        }
      ]
    },
    {
      "id": "r_1760231753472",
      "course_id": "jlcd1",
      "rating": null,
      "author": null,
      "text": "Dr. Hicks is goated, I’m not even gonna lie. She’s super helpful in both office hours and in class discussion. She keeps track of participation using “Golden Tickets” which give you priority to speak during class and never cold-calls and is helpful on her comments and also occasionally adjusts her office hours according to everyone’s schedule. Only slight downside is that she takes a while to grade. REGARDLESS GET THIS TEACHER OR DIE",
      "created_at": "2025-10-12T01:15:53.472Z",
      "status": "published",
      "replies": [
        {
          "id": "rp_1760233110849",
          "review_id": "r_1760231753472",
          "author": null,
          "text": "^you’ve clearly never met HWD",
          "created_at": "2025-10-12T01:38:30.849Z"
        }
      ]
    },
    {
      "id": "r_1760231727284",
      "course_id": "jlcd1",
      "rating": null,
      "author": null,
      "text": "(Dr. Hicks) Great teacher, great course. The readings are all super interesting, even though they are confusing sometimes. Workload is not overly much. Assignments are really fun, only downside Dr. Hicks (who is a great teacher, and leads awesome discussions) is a really slow grader.",
      "created_at": "2025-10-12T01:15:27.284Z",
      "status": "published"
    },
    {
      "id": "r_1760231672898",
      "course_id": "jlcd1",
      "rating": 5,
      "author": null,
      "text": "Holy moly this class was amazing! Dr. Walker-Dale is an incredible instructor and leads very engaging discussions. She grades pretty easy but her feed back is to die for… she writes entire pages for you and her feedback can be longer than what you actually wrote. Topics taught are quite unique (quantum theory, modernity, etc.) and you even get to lead class for a day (where you can cold call lol). HWD was helpful in office hours but she likes participation so participating a lot will help. Also readings were super long so I’d recommend that you start early on them. 11/10 and would 100% recommend! :D",
      "created_at": "2025-10-12T01:14:32.898Z",
      "status": "published"
    },
    {
      "id": "r_1760230990094",
      "course_id": "jlcd1",
      "rating": null,
      "author": null,
      "text": "Great class!!!, but tons of preparation",
      "created_at": "2025-10-12T01:03:10.094Z",
      "status": "published"
    }
  ],
  "jhns2": [
    {
      "id": "r_1760233445476",
      "course_id": "jhns2",
      "rating": null,
      "author": null,
      "text": "(Dr. Weil) [2025] Dr. Weil is a nice guy but I do have a bit of a bone to pick. Generally I found his discussions uninteresting and not super engaging, but take that as you may. My biggest pet peeve with Weil is that he’s very unclear with what he wants from you, and gives pretty confusing and un-constructive feedback. Best thing I can recommend if you’re struggling with that is to go to office hours and talk with him and get clear on his expectations. Just try and get through it as best you can. I will say that I found it hard to express opinions or go about work the way it made sense for me. He’s very strict about writing his way, understanding things his way, and doing things his way. The first few months were okay, but near the end of the semester I just felt tired and depleted. If you get him, you’ll work through it, but if you can switch, I would suggest it.",
      "created_at": "2025-10-12T01:44:05.476Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233441892",
      "course_id": "jhns2",
      "rating": null,
      "author": null,
      "text": "(Dr. Neemeh) [2024] Dr. Neemeh was great! They were super chill and good at handling fights and issues in the chat. They’re very respectful, especially if personal issues are interfering with your participation in the class. The discussions are interesting and civil, some of the most fun I’ve had. They’re a bit of a harsh grader but are very good at giving clear and concise feedback to help you grow as a writer. Neemeh is the GOAT, would recommend👍",
      "created_at": "2025-10-12T01:44:01.892Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233436108",
      "course_id": "jhns2",
      "rating": null,
      "author": null,
      "text": "(Dr. Rees) [2025] bro dr rees is def the worst hns teacher. The class basically teaches you to have an open mind, but he has the opposite of an open mind, like he takes off points for not perfectly conforming to his vision of what a philosopher is. It is downright painful to try and make a logical argument during class, since he just bulldozes it down by totally ignoring it and forcing everyone to focus on what some dumb philosopher says. Like the whole point of hns is to learn how to think, but all dr rees teaches is how other philosophers think, there’s not much practice on thinking for yourself. Some parts of the class were inherently dumb, like the phrase “human nature” (humans are so fricking diverse) or the fact that you get points taken off reading questions if you add some of your opinion to it (you just have to word vomit the opinions and badly formed arguments of some philosopher from the reading) and my friend got points taken off for some really dumb reasons, like not fully articulating an obvious idea. From what I can see, the only way to get an A in this class with this teacher is to either 1. Be a really good writer or 2. Read the readings cover to cover and essentially just answer each question in the most boring, obvious way. He also doesn’t read the chat. Which is a problem, obviously. Also don’t use the word “solid” in assignments, he can’t seem to comprehend that it has multiple meanings other than a stage of matter.",
      "created_at": "2025-10-12T01:43:56.108Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233409996",
      "course_id": "jhns2",
      "rating": null,
      "author": null,
      "text": "(Dr. Rees) [2025] Dr. Rees is amazing. He grades easy, he is super nice, and the class is just very fun overall. The best part of HNS is randomly criticizing every single philosopher there is & debating about everything aggressively with classmates. And the readings… uh if you don’t like the readings at first, you will at least definitely have better reading comprehension skills by the end of the class. Note for new students: don’t discuss off-topic stuff in the comments, even if it’s about philosophy too. Dr. Rees normally doesn’t watch the comments section because it’s a whirlwind of aggression and colorful speech bubbles, but you can tell sometimes he’s annoyed by it too lol",
      "created_at": "2025-10-12T01:43:29.996Z",
      "status": "published",
      "replies": [
        {
          "id": "rp_1760233420988",
          "review_id": "r_1760233409996",
          "author": null,
          "text": "^Well idk about that but I also got straight As so… personal opinion i guess. Also, the class is NOT boring. At least for my class. It’s literally the least boring class there is and everything is so chaotic. You’ll survive not being off-topic for a few minutes. Looking at the comments, did we even get the same teacher?",
          "created_at": "2025-10-12T01:43:40.988Z"
        },
        {
          "id": "rp_1760233415948",
          "review_id": "r_1760233409996",
          "author": null,
          "text": "^bruh since when does he grade easy? I got almost straight As, but my buddy who is awesome at philosophy got like awful grades for dumb reasons.",
          "created_at": "2025-10-12T01:43:35.948Z"
        }
      ]
    },
    {
      "id": "r_1760233398627",
      "course_id": "jhns2",
      "rating": null,
      "author": null,
      "text": "(Dr. Rees)[2025] I really like the class, since it has a lot of different views that are fun to argue against. Totally recommended for anyone who loves arguing/debate/logic and will argue against almost every philosopher just because they can. Dr Rees is cool, but he grades kinda harsh, so make sure your writing is perfectly clear and you address every single part of the prompt.",
      "created_at": "2025-10-12T01:43:18.627Z",
      "status": "published",
      "replies": [
        {
          "id": "rp_1760233405141",
          "review_id": "r_1760233398627",
          "author": null,
          "text": "^I agree with everything above, except I wouldn’t recommend Dr. Rees for students who like to think for themselves. It’s incredibly aggravating. Spoken as someone who personally insulted most of the philosophers from the readings for valid reasons. HWD is the best teacher for this class.",
          "created_at": "2025-10-12T01:43:25.141Z"
        }
      ]
    },
    {
      "id": "r_1760233394412",
      "course_id": "jhns2",
      "rating": null,
      "author": null,
      "text": "(Dr. Neemeh) [2024] Pretty nice class! The readings can feel really long, but Dr. Neemeh spends a good amount of time explaining during class. My biggest concern is that we often have really long readings and have to submit reading questions before having class time to properly break down the reading. Honestly not too bad, it can be stressful at times, but as long as you take time to close read you can do pretty well.",
      "created_at": "2025-10-12T01:43:14.412Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233386636",
      "course_id": "jhns2",
      "rating": null,
      "author": null,
      "text": "(Dr. Weil) [2023-2024] Meh class. A lot of him rambling about the material and making us summarize it in the discussion sections so it was kind of underwhelming. He gives a lot of feedback on assignments but 50% of it is “elaborate on this.” He’s pretty helpful in office hours and responds to emails a lot but I usually went to office hours to figure out what he wanted me to write so most of the essays were really based on his conception of a “good paper” rather than an interesting thesis/content. Another really annoying aspect of his course is that he would ask us to participate in class and share our opinions about the reading but when we talked about our opinions he would criticize them so participation really went down at the end of the year. Also the reading questions due before class are super unhelpful since they are worth a decent portion of your grade and they are graded based on correctness. The problem is, they are done before class so there isn’t time to ask for help or let the material sink in. A decent amount of students were kinda stressed about the reading questions since some of the questions were cryptic and the readings were convoluted at times. I feel like the course causes more annoyance than stress but overall you are not missing out if you don’t take it. If you end up taking it I would recommend getting a different teacher to avoid boredom and annoyance. Might have been because I wasn’t really interested in what we were reading but the teacher didn’t help.",
      "created_at": "2025-10-12T01:43:06.636Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233380220",
      "course_id": "jhns2",
      "rating": null,
      "author": null,
      "text": "(Dr. Walker-Dale) [2023-2024] This class was great and really fun! Dr. HWD’s feedback on assignments was always the best and really helpful in the future.  I can tell that she took a careful and long time examining all my papers and definitely helped me understand this course well, because I was very shaky in the beginning.",
      "created_at": "2025-10-12T01:43:00.220Z",
      "status": "published",
      "replies": []
    }
  ],
  "omsb9": [
    {
      "id": "r_1760233939996",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr.Chance) I think he is very good at actual philosophy classes, and this class is more based on stats. He doesn't really know how to solve your problems if you don't know something( usually it's better to ask AI for help) He gives B+ to A for the big writing assignments. It's very weird how this course curves the midterms and finals, but i think Dr.Chance usually gives A’s for them.",
      "created_at": "2025-10-12T01:52:19.996Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233935572",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr Chance) Dr Chance is a very good teacher in general, the class discussions are kinda useful and there is some other content outside of the lectures, the course isnt rlly good but dr chance is a nice teacher, but his voice makes me want to go to sleep for some reason.",
      "created_at": "2025-10-12T01:52:15.572Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233931443",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr. Wallhagen) [2023-2024] - honestly dr. wallhagen is way overhated while he’s a strict grader, if you make sure to do the readings and go to his office hours, he really cares about making sure you understand the material and do as well as you can. The quizzes were definitely hard and required you to think about the material, but the writing assignments were super fun and so were jeopardy weeks!",
      "created_at": "2025-10-12T01:52:11.443Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233926163",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Mare) Its basically just a stats class with very little bio or philosophy so if you’re into that it probably won’t be too bad. Personally, I was not a fan because it was sold to me as a philosophical bio class and I hated all the stats stuff. Dr. Mare is fine, talks pretty slow and monotone and can get sidetracked but he’s mostly chill. The only time I really didn’t like him was when I forgot to submit something and he absolutely ripped me to shreds in his comment on canvas.",
      "created_at": "2025-10-12T01:52:06.163Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233922424",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Mare) I hated the class, dropped it for the second semester. The content was just really confusing and chaotic for me. The lectures were boring and VERY LONG. Mare isn’t too bad (he let me do finals corrections even after I dropped the course), I just dislike the course and how its setup, especially how topics are introduced.",
      "created_at": "2025-10-12T01:52:02.424Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233919428",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr Neemeh) [2023-2024] I didn’t find the discussions in class super helpful since usually we just went over the same things that we learned in the lectures before class, and didn’t go much deeper than that. This deeper analysis would have been helpful since there were numerous quiz questions that were either on material that wasn’t explicitly taught, or required analysis of what was taught, but then you were never taught how to do that analysis. A lot of the exams and midterms had those sort of questions too, so I’m glad there were corrections. Definitely go to office hours or email if you have any questions since you can avoid getting docked points pretty easily that way.",
      "created_at": "2025-10-12T01:51:59.428Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233916564",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr Wallhagen) [2023-2024] Super awesome teacher. Makes the class interesting and goes really in-depth with the material. You can tell he really enjoys teaching, and he brings that enthusiasm to his lectures. He challenges his students, which will definitely make yo+u a better learner, and he always makes sure to stay on a particular subject until the entire class understands it, not just the most advanced students. Also, he is willing to engage in discussions with students and gets super interested in what they have to say, even if it’s not entirely related to the subject of discussion (for example if you have an insight about the material and want to share it, many times it will turn into a class-wide discussion). In my experience, his grading is extremely lenient on writing assignments, but very strict on the short answer sections of the exams.",
      "created_at": "2025-10-12T01:51:56.564Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233912525",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr. Neemeh) [2023-2024] Super helpful MSB teacher! The course itself was not too bad but the stats were a little confusing as that was totally a new field for me. Dr. Neemeh was a great teacher though and helped me to understand the material. As long as you watch the lectures before class (very important to do!!) then the class will make sense. The course workload wasnt too much but for writing assignments definitely dont wait until last minute in case you need help on answering some of the questions (as Dr. Neemeh doesnt usually answer emails over weekends). He was helpful in office hours and lets you run ideas by him to let you know if you are on the right track. Also not a mean grader! As long as you put in the work and show an understanding of the material, its not hard to get an A (this is for things like the writing assignments). The exams in this class are a little challenging but as long as you understand the material you will be fine. The exams are open note so they wont ask simple definition questions and will require you to be well versed in the subject. But dont let that discourage you!!! Just make sure to always watch the lectures before class and if you are struggling with something then go to office hours. If you do this then you will be just fine. There were, at least this year, corrections for the exams that will give you up to half points back. Dr. Neemeh is a pretty fair and lenient grader on exams. Overall great teacher but MSB was not my favorite course. (Though not hard to finish with a strong A as long as you put in the work :))!",
      "created_at": "2025-10-12T01:51:52.525Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233907380",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr. Tillman) Dr Tillman is nice and his tangents where kinda funny, but honestly they didn’t really help me understand the topic. The lectures are really important because not everything covered in the lectures is covered in class, and the weekly quizzes are on the content covered in the lectures. The quizzes are kinda confusing, as they are more focused on applying what we learned in the lectures, not showing that you watched them. The midterms/finals and essays were weird, and I usually got worse grades than I was expecting tbh.",
      "created_at": "2025-10-12T01:51:47.380Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233903740",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "Tillman is a great teacher but has hneemehigh specific standards, but is fair and a good teacher",
      "created_at": "2025-10-12T01:51:43.740Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233900188",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr Tillman) Definitely the best MSB teacher. Is very engaging and willing to explain material. His classes are honestly really fun and enjoyable, and he is good about having review",
      "created_at": "2025-10-12T01:51:40.188Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233894564",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "I also agree that Neemeh is the best MSB instructor. They made sure the class was engaging and fun, and never made me feel stupid. Neemeh also had a thing with checking up with some students before class started, and idk I thought that was super helpful with making the environment less stressful. If someone had a question they made sure to let us know that OH was always open for us, or we could ask in class. I do not recommend emailing them because they take an eternity to respond, so PLEASE take into consideration the OH or in class questions seriously! But I definitely recommend Dr. Neemeh as a core instructor for those who were wondering :D",
      "created_at": "2025-10-12T01:51:34.564Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233890940",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr Neemeh) [2024-2025] Dr. Neemeh is an AMAZING teacher. They teach clearly, concisely and is super kind, so if you need any help on a quiz, an assignment, or even just to chat, Dr. Neemeh is there for you in office hours! I learnt so much in MSB and was amazed by how they explained things. A tip I have for this course is to write notes during class, as it is super helpful for the weekly quizzes. If you have any questions, ask Dr. Neemeh because you want to make sure that you understand each concept. The class environment is super chill and not stressful at all! Overall, amazing course, amazing teacher.",
      "created_at": "2025-10-12T01:51:30.940Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233887628",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "Dr. Neehmeh was a good teacher and a fair grader, you could easily tell what they wanted if you got points taken off. My only complaint is that they were not always the fastest to answer emails and office hours. Other than that it was a great year.",
      "created_at": "2025-10-12T01:51:27.628Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233884692",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr Neemeh) [2023-2024] Probably the best MSB teacher ngl.",
      "created_at": "2025-10-12T01:51:24.692Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233880100",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr. Wallhagen) [2023-2024] Amazing at helping you understand a topic if you ask the right questions, you can’t expect everything to be spoon-fed to you so if you have questions in his class ASK. He is quite a specific and harsh grader at times which can be difficult to cope with. Also if you are doing an assignment BE AS SPECIFIC AS POSSIBLE. He isn’t really as bad as a teacher that everyone makes him seem to be, but if you are fragile about grades and don’t think you can handle learning from mistakes probably go for another section. (I agree)",
      "created_at": "2025-10-12T01:51:20.100Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233875060",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr Wallhagen) [2023-2024] he’s chill and cool until he grades your stuff, then hes really strict. Also don’t say “damn” or “hell” or eat in class because he will like     call you out for that, but tbh hes overhated and if you care more about understanding the material and having a fun time in class then go ahead.",
      "created_at": "2025-10-12T01:51:15.060Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233870891",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr Wallhagen) [2023-2024] lets just say he will ruin your gpa and roast you on anything you get wrong, tillman is considered best msb teacher",
      "created_at": "2025-10-12T01:51:10.891Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233866220",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr. Wallhagen) [2024-2025] He wasn’t bad, but he wasn’t exactly great either. I would NOT say the environment is very welcoming. I have frozen up when asked questions in his class- something that has never happened in another class. Also cried during jeopardy.",
      "created_at": "2025-10-12T01:51:06.220Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233862363",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "AVOID WALLHAGEN AT ALL COSTS",
      "created_at": "2025-10-12T01:51:02.363Z",
      "status": "published",
      "replies": []
    },
    {
      "id": "r_1760233858219",
      "course_id": "omsb9",
      "rating": null,
      "author": null,
      "text": "(Dr. Mare) [2023-2024] MSB IS AWESOME!!! Don’t let the fools down below tell you otherwise. Not particularly interesting but it’s not that bad",
      "created_at": "2025-10-12T01:50:58.219Z",
      "status": "published",
      "replies": []
    }
  ]
}